title: EP Web Solutions CMS - Cross Site Scripting
id: 73b45a2d-e5ce-4cc3-bd9d-1e35491832dc
status: experimental
logsource:
  product: webserver
description: 'Cross-site scripting is an attack in which an attacker injects malicious
  executable scripts into the code of a trusted application or website.

  '
reference: 'Generated by converting Nuclei Template. Template ID: ep-web-cms-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /shop.php
  selection-query-1:
    cs-uri-query:
      - search=%22/%3E%3Cscript%3Ealert(document.domain)%3C/script%3E
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
