title: Interlib - Local File Inclusion
id: 29ab3e09-d478-41ed-bde6-1196bf50433e
status: experimental
logsource:
  product: webserver
description: Interlib is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: interlib-fileread
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /interlib/report/ShowImage
      - /interlib/report/ShowImage
  selection-query-1:
    cs-uri-query:
      - localPath=etc/passwd
      - localPath=C:\Windows\system.ini
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
