title: AVCON6 - Arbitrary File Download
id: 4b12c179-687e-487f-8b9b-ef7e0c5f500a
status: experimental
logsource:
  product: webserver
description: 'File Download vulnerability in the download.action of the AVCON6 system
  management platform, through which an attacker can download arbitrary files from
  the server

  '
reference: 'Generated by converting Nuclei Template. Template ID: avcon6-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /download.action
  selection-query-1:
    cs-uri-query:
      - filename=../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
