title: VMware vCenter - Server-Side Request Forgery/Local File Inclusion/Cross-Site
  Scripting
id: e3fe7f93-e28e-46eb-bd7d-20563085893b
status: experimental
logsource:
  product: webserver
description: VMware vCenter 7.0.2.00100 is susceptible to multiple vulnerabilities
  including server-side request forgery, local file inclusion, and cross-site scripting.
reference: 'Generated by converting Nuclei Template. Template ID: vmware-vcenter-ssrf
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pdteam; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /ui/vcav-bootstrap/rest/vcav-providers/provider-logo
  selection-query-1:
    cs-uri-query:
      - url=https://{{interactsh-url}}
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
