title: SquirrelMail Virtual Keyboard <=0.9.1 - Cross-Site Scripting
id: 50d59cbd-230a-4c66-b59f-b735b525ce0c
status: experimental
logsource:
  product: webserver
description: SquirrelMail Virtual Keyboard plugin 0.9.1 and prior contains a cross-site
  scripting vulnerability via the vkeyboard.php parameter. It fails to properly sanitize
  user-supplied input, which allows an attacker to execute arbitrary script in the
  browser of an unsuspecting user in the context of the affected site. This can allow
  the attacker to steal cookie-based authentication credentials and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: squirrelmail-vkeyboard-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /plugins/vkeyboard/vkeyboard.php
  selection-query-1:
    cs-uri-query:
      - passformname={{url_encode(payload)}}
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
