title: Ecology Springframework - Local File Inclusion
id: b56b01d9-2c74-4bc7-ba4b-8d2502c84fd1
status: experimental
logsource:
  product: webserver
description: Ecology Springframework is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: ecology-springframework-directory-traversal
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /weaver/org.springframework.web.servlet.ResourceServlet
  selection-query-1:
    cs-uri-query:
      - resource=/WEB-INF/web.xml
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
