title: WordPress Blogroll Fun-Show Last Post and Last Update Time 0.8.4 - Cross-Site
  Scripting
id: 0afcbd7d-78bb-440c-bb7d-eb7b621746aa
status: experimental
logsource:
  product: webserver
description: 'WordPress Plugin Blogroll Fun-Show Last Post and Last Update Time 0.8.4
  and possibly prior versions are prone to a cross-site scripting vulnerability because
  of a failure to properly sanitize user-supplied input. An attacker may leverage
  this issue to execute arbitrary script code in the browser of an unsuspecting user
  in the context of the affected site. This can allow the attacker to steal cookie-based
  authentication credentials and launch other attacks.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wp-blogroll-fun-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/blogroll-fun/blogroll.php
  selection-query-1:
    cs-uri-query:
      - k=%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
