title: WordPress Adaptive Images < 0.6.69 - Cross-Site Scripting
id: cc04f7f8-5f92-4a7b-a6db-357facb84966
status: experimental
logsource:
  product: webserver
description: WordPress Adaptive Images < 0.6.69 is susceptible to cross-site scripting
  because the plugin does not sanitize and escape the REQUEST_URI before outputting
  it back in a page.
reference: 'Generated by converting Nuclei Template. Template ID: wp-adaptive-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/adaptive-images/adaptive-images-script.php/%3Cimg/src/onerror=alert(document.domain)%3E/
  selection-query-1:
    cs-uri-query:
      - debug=true
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
