title: WordPress AVChat Video Chat 1.4.1 - Cross-Site Scripting
id: bf74bdf8-93fc-4d7f-9210-06cfd6b03750
status: experimental
logsource:
  product: webserver
description: 'WordPress AVChat Video Chat 1.4.1 is vulnerable to reflected cross-site
  scripting via index_popup.php and multiple parameters.

  '
reference: 'Generated by converting Nuclei Template. Template ID: avchat-video-chat-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/avchat-3/index_popup.php
  selection-query-1:
    cs-uri-query:
      - movie_param=%3C/script%3E%3Cscript%3Ealert(document.domain)%3C/script%3E&FB_appId=FB_appId%22%3E%3Cscript%3Ealert(document.domain)%3C/script%3E&
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
