title: AspCMS commentList.asp - SQL Injection
id: ca6aeee5-33f5-49d6-8f4e-1234e6970af2
status: experimental
logsource:
  product: webserver
description: 'An SQL injection vulnerability has been identified in the commentList.asp
  file of AspCMS. Exploiting this vulnerability, an attacker can illicitly acquire
  the administrator''s MD5 password.

  '
reference: 'Generated by converting Nuclei Template. Template ID: aspcms-commentlist-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /plug/comment/commentList.asp
  selection-query-1:
    cs-uri-query:
      - id=-1%20unmasterion%20semasterlect%20top%201%20UserID,GroupID,LoginName,Password,now(),null,1%20%20frmasterom%20{prefix}user
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
