title: WordPress GTranslate <2.8.11 - Open Redirect
id: 4d1e0d40-0ada-46af-8811-09937ad47d1f
status: experimental
logsource:
  product: webserver
description: Translate WordPress with GTranslate plugin before 2.8.11 contains an
  open redirect vulnerability. An attacker can redirect a user to a malicious site
  and possibly obtain sensitive information, modify data, and/or execute unauthorized
  operations.
reference: 'Generated by converting Nuclei Template. Template ID: wp-gtranslate-open-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/gtranslate/url_addon/gtranslate.php
  selection-query-1:
    cs-uri-query:
      - glang=en&gurl=/www.pluginvulnerabilities.com
  selection-status-code-1:
    sc-status: 301
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
