title: Product Input Fields for WooCommerce < 1.2.7 - Unauthenticated File Download
id: b7d7fea1-b193-4957-9107-0e7cea748422
status: experimental
logsource:
  product: webserver
description: 'WordPress WooCommerce < 1.2.7 is susceptible to file download vulnerabilities.
  The lack of authorization checks in the handle_downloads() function hooked to admin_init()
  could allow unauthenticated users to download arbitrary files from the blog using
  a path traversal payload.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wp-woocommerce-file-download
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-admin/admin-post.php
  selection-query-1:
    cs-uri-query:
      - alg_wc_pif_download_file=../../../../../wp-config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
