title: OpenCTI 3.3.1 - Local File Inclusion
id: 2ab1ec99-7e8a-457f-ad79-3dcd66f1de96
status: experimental
logsource:
  product: webserver
description: OpenCTI 3.3.1 is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: opencti-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /static/css//../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
