title: Asanhamayesh CMS 3.4.6 - Local File Inclusion
id: fa77e4fa-dbc7-49b5-af72-c081b0eacb8b
status: experimental
logsource:
  product: webserver
description: Asanhamayesh CMS 3.4.6 is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: asanhamayesh-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /downloadfile.php
  selection-query-1:
    cs-uri-query:
      - file=../../../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
