title: Gnuboard CMS - Cross-Site Scripting
id: a9dda9e2-05f8-427b-bd43-acf95a4c99ad
status: experimental
logsource:
  product: webserver
description: Gnuboard CMS contains a cross-site scripting vulnerability which allows
  remote attackers to inject arbitrary JavaScript into the responses returned by the
  server.
reference: 'Generated by converting Nuclei Template. Template ID: gnuboard-sms-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: gy741; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /plugin/sms5/ajax.sms_emoticon.php
  selection-query-1:
    cs-uri-query:
      - arr_ajax_msg=gnuboard<svg+onload=alert(document.domain)>
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
