title: Joomla iProperty Real Estate 4.1.1 - Cross-Site Scripting
id: 953f7217-a44c-4359-9111-f7f410469c2b
status: experimental
logsource:
  product: webserver
description: 'Joomla extension iproperty is vulnerable to XSS in GET parameter ''filter_keyword''.

  '
reference: 'Generated by converting Nuclei Template. Template ID: joomla-iproperty-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /iproperty/property-views/all-properties-with-map
  selection-query-1:
    cs-uri-query:
      - filter_keyword=pihil%22onmouseover=%22alert(document.domain)%22style=%22position:absolute;width:100%;height:100%;top:0;left:0;%22f63m4&option=com_iproperty&view=allproperties&ipquicksearch=1
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
