title: EmpireCMS 7.5 - Cross-Site Scripting
id: f9bb7136-7fc2-425f-b6e9-5f54d133e136
status: experimental
logsource:
  product: webserver
description: EmpireCMS 7.5 contains a cross-site scripting vulnerability. An attacker
  can execute arbitrary script and thus steal cookie-based authentication credentials
  and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: empirecms-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /e/ViewImg/index.html
  selection-query-1:
    cs-uri-query:
      - url=javascript:alert(document.domain)
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
