title: Joomla JoomBri Careers 3.3.0 - Cross-Site Scripting
id: 6c37ca40-6f1c-49d9-925a-71c283b8b2e1
status: experimental
logsource:
  product: webserver
description: 'The attacker can send to victim a link containing a malicious URL in
  an email or instant message can perform a wide variety of actions, such as stealing
  the victim''s session token or login credentials.

  '
reference: 'Generated by converting Nuclei Template. Template ID: joomla-joombri-careers-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /for-jobseekers/search-jobs
  selection-query-1:
    cs-uri-query:
      - keyword=l9x1q%22onfocus%3D%22alert(document.domain)%22autofocus%3D%22ak5aghi5u9p
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
