title: Joomla jMarket 5.15 - Cross-Site Scripting
id: 69af53e0-decb-4ab7-a237-cb210b433d0e
status: experimental
logsource:
  product: webserver
description: 'The attacker can send to victim a link containing a malicious URL in
  an email or instant message can perform a wide variety of actions, such as stealing
  the victim''s session token or login credentials.

  '
reference: 'Generated by converting Nuclei Template. Template ID: joomla-jmarket-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - option=com_jvouchers&controller=catalog-results&task=query&wajx=1&wmjx=1&tmpl=component&type=raw&crtyid=12&trucs[x][search]=gx3vt%20onfocus=alert(document.domain)%20autofocus=%20itkrzsug7w5
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
