title: Moodle Jmol Filter 6.1 - Local File Inclusion
id: db65f150-f2d3-4b20-b451-3551415a13ae
status: experimental
logsource:
  product: webserver
description: Moodle is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: moodle-filter-jmol-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: madrobot; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /filter/jmol/js/jsmol/php/jsmol.php
  selection-query-1:
    cs-uri-query:
      - call=getRawDataFromDatabase&query=file:///etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
