title: WatchGuard Fireware AD Helper Component - Credentials Disclosure
id: f0d94bf7-ac0c-4715-9f8d-abf188f8ecd3
status: experimental
logsource:
  product: webserver
description: WatchGuard Fireware Threat Detection and Response (TDR) service contains
  a credential-disclosure vulnerability in the AD Helper component that allows unauthenticated
  attackers to gain Active Directory credentials for a Windows domain in plaintext.
reference: 'Generated by converting Nuclei Template. Template ID: watchguard-credentials-disclosure
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: gy741; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /rest/domains/list
  selection-query-1:
    cs-uri-query:
      - sortCol=fullyQualifiedName&sortDir=asc
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
