title: TurboCRM - Cross-Site Scripting
id: 4be962e4-c055-4828-8d1a-6ee690c11d75
status: experimental
logsource:
  product: webserver
description: TurboCRM contains a cross-site scripting vulnerability which allows a
  remote attacker to inject arbitrary JavaScript into the response returned by the
  application.
reference: 'Generated by converting Nuclei Template. Template ID: turbocrm-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /login/forgetpswd.php
  selection-query-1:
    cs-uri-query:
      - loginsys=1&loginname=%22%3E%3Cscript%3Ealert(document.domain)%3C/script%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
