title: Nacos 1.x - Authentication Bypass
id: 0988d3e9-2151-4260-a48a-ae2cbebcd156
status: experimental
logsource:
  product: webserver
description: 'Nacos 1.x was discovered. A default Nacos instance needs to modify the
  application.properties configuration file or add the JVM startup variable Dnacos.core.auth.enabled=true
  to enable the authentication function (reference: https://nacos.io/en-us/docs/auth.html).
  But authentication can still be bypassed under certain circumstances and any interface
  can be called as in the following example that can add a new user (POST https://127.0.0.1:8848/nacos/v1/auth/users?username=test&password=test).
  That user can then log in to the console to access, modify, and add data.

  '
reference: 'Generated by converting Nuclei Template. Template ID: nacos-auth-bypass
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: taielab,pikpikcu,SleepingBag945; Converted to Sigma
  by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /nacos/v1/auth/users
      - /v1/auth/users
  selection-query-1:
    cs-uri-query:
      - pageNo=1&pageSize=9
      - pageNo=1&pageSize=9
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
