title: Chanjet TPlus DownloadProxy.aspx - Arbitrary File Read
id: 95763b4b-0a6c-43e6-97ae-2626b86370e3
status: experimental
logsource:
  product: webserver
description: 'Chanjet TPlus DownloadProxy.aspx file has an arbitrary file reading
  vulnerability. An attacker can obtain sensitive files on the server through the
  vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: chanjet-tplus-file-read
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /tplus/SM/DTS/DownloadProxy.aspx
  selection-query-1:
    cs-uri-query:
      - preload=1&Path=../../Web.Config
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
