title: WordPress Custom Tables 3.4.4 - Cross-Site Scripting
id: bbcd7daa-9a0b-4bf2-b145-5f6c2aa4c1d3
status: experimental
logsource:
  product: webserver
description: WordPress Custom Tables 3.4.4 plugin contains a cross-site scripting
  vulnerability via the key parameter.
reference: 'Generated by converting Nuclei Template. Template ID: wp-custom-tables-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: daffainfo; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/custom-tables/iframe.php
  selection-query-1:
    cs-uri-query:
      - s=1&key=%3C%2Fscript%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
