title: Joomla MarvikShop ShoppingCart 3.4 - Sql Injection
id: 949e3d9a-3459-45a0-8143-52e6186b9fc7
status: experimental
logsource:
  product: webserver
description: 'Joomla MarvikShop ShoppingCart 3.4 is vulnerable to SQL injection which
  is a code injection technique that might destroy your database. SQL injection is
  one of the most common web hacking techniques. SQL injection is the placement of
  malicious code in SQL statements, via web page input.

  '
reference: 'Generated by converting Nuclei Template. Template ID: joomla-marvikshop-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - option=com_oscommerce&osMod=mshop_pl_src&manufacturers_id=7&sort=products_sort_order&page=index.php&format=xml&task=showproducts&view=med&sort=latest&sortdir=%27
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
