title: IBM Eclipse Help System - Cross-Site Scripting
id: fa775095-d59f-467a-bf3f-b2f78fa08e1b
status: experimental
logsource:
  product: webserver
description: IBM Eclipse Help System 6.1.0 through 6.1.0.6, 6.1.5 through 6.1.5.3,
  7.0 through 7.0.0.2, and 8.0 prior to 8.0.0.1 contains a cross-site scripting vulnerability.
  An attacker can execute arbitrary script in the browser of an unsuspecting user
  in the context of the affected site.
reference: 'Generated by converting Nuclei Template. Template ID: eclipse-help-system-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /help/index.jsp
  selection-query-1:
    cs-uri-query:
      - view=%3Cscript%3Ealert(document.cookie)%3C/script%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
