title: Eibiz i-Media Server Digital Signage 3.8.0 - Local File Inclusion
id: 9e98aac3-4c6a-4b6a-b965-94f2bafc1ad8
status: experimental
logsource:
  product: webserver
description: Eibiz i-Media Server Digital Signage 3.8.0 is vulnerable to local file
  inclusion. An unauthenticated remote attacker can exploit this to view the contents
  of files located outside of the server's root directory. The issue can be triggered
  through the oldfile GET parameter.
reference: 'Generated by converting Nuclei Template. Template ID: eibiz-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /dlibrary/null
  selection-query-1:
    cs-uri-query:
      - oldfile=../../../../../../windows/win.ini&library=null
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
