title: WordPress Simple Fields 0.2 - 0.3.5 LFI/RFI/RCE
id: 28d45e01-f425-4f3f-b122-72d0326ff255
status: experimental
logsource:
  product: webserver
description: WordPress Simple Fields 0.2 is vulnerable to local file inclusion, remote
  file inclusion, and remote code execution.
reference: 'Generated by converting Nuclei Template. Template ID: wp-simple-fields-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x240x23elu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/simple-fields/simple_fields.php
  selection-query-1:
    cs-uri-query:
      - wp_abspath=/etc/passwd%00
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
