title: WiseGiga NAS - Arbitrary File Read
id: 6505c6dc-842e-422d-94c2-78600bf99842
status: experimental
logsource:
  product: webserver
description: 'WISEGIGA NAS down_data.php has an arbitrary file download vulnerability.
  Due to the lax filtering of the filename parameter on the /down_data.php page, sensitive
  system files can be read.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wisegiga-nas-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pussycat0x; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /down_data.php
  selection-query-1:
    cs-uri-query:
      - filename=../../../../../../../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
