title: EyeLock nano NXT 3.5 - Arbitrary File Retrieval
id: 73eaac7c-5c19-4a77-ac18-425994a020d1
status: experimental
logsource:
  product: webserver
description: EyeLock nano NXT suffers from a file retrieval vulnerability when input
  passed through the 'path' parameter to 'logdownload.php' script is not properly
  verified before being used to read files. This can be exploited to disclose contents
  of files from local resources.
reference: 'Generated by converting Nuclei Template. Template ID: eyelock-nano-lfd
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: geeknik; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /scripts/logdownload.php
  selection-query-1:
    cs-uri-query:
      - dlfilename=juicyinfo.txt&path=../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
