title: Groupoffice 3.4.21 - Local File Inclusion
id: e8773f5e-485a-47b1-9554-a95e21aea373
status: experimental
logsource:
  product: webserver
description: Groupoffice 3.4.21 is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: groupoffice-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /compress.php
  selection-query-1:
    cs-uri-query:
      - file=../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
