title: OA E-Office officeserver.php Arbitrary File Read
id: 82a994ab-cd86-4de6-b427-9ce346599b83
status: experimental
logsource:
  product: webserver
description: 'There is an arbitrary file reading vulnerability in the OA E-Office
  officeserver.php file. An attacker can download any file on the server through the
  vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: weaver-officeserver-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /iweboffice/officeserver.php
  selection-query-1:
    cs-uri-query:
      - OPTION=LOADFILE&FILENAME=../mysql_config.ini
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
