title: AVTECH DVR - SSRF
id: 9719ec3f-e7c6-495c-8175-5b0b604f137f
status: experimental
logsource:
  product: webserver
description: 'AVTECH DVR device, Search.cgi can be accessed directly. Search.cgi is
  responsible for searching and accessing cameras in the local network. Search.cgi
  provides the cgi_query function.

  '
reference: 'Generated by converting Nuclei Template. Template ID: avtech-dvr-ssrf
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /cgi-bin/nobody/Search.cgi
  selection-query-1:
    cs-uri-query:
      - action=scan
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
