title: WordPress SocialFit - Cross-Site Scripting
id: 37c1c170-fe76-4db5-b6c3-54ac6684292f
status: experimental
logsource:
  product: webserver
description: 'WordPress SocialFit is vulnerable to a cross-site scripting vulnerability
  via the ''msg'' parameter because it fails to properly sanitize user-supplied input.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wp-socialfit-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: daffainfo; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/socialfit/popup.php
  selection-query-1:
    cs-uri-query:
      - service=googleplus&msg=%3C%2Fscript%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
