title: Crawlab - Arbitrary File Read
id: 3acfdcbe-e3f1-412c-b1b7-4b3946435e4c
status: experimental
logsource:
  product: webserver
description: Crawlab is vulnerable to arbitrary file read.
reference: 'Generated by converting Nuclei Template. Template ID: crawlab-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pussycat0x; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /api/file
  selection-query-1:
    cs-uri-query:
      - path=../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
