title: Fanruan Report 2012 Information Disclosure
id: dd5db5ce-c075-4245-9813-d815426f30e7
status: experimental
logsource:
  product: webserver
description: Fanruan Report 2012 has an information disclosure vulnerability, and
  some sensitive information can be obtained by accessing a specific URL
reference: 'Generated by converting Nuclei Template. Template ID: fanruanoa2012-disclosure
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: YanYun; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /ReportServer
      - /WebReport/ReportServer
  selection-query-1:
    cs-uri-query:
      - op=fr_server&cmd=sc_getconnectioninfo
      - op=fr_server&cmd=sc_getconnectioninfo
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
