title: Wordpress Plugin Issuu Panel Remote/Local File Inclusion
id: 06be27ac-365c-4801-9069-911751ba1968
status: experimental
logsource:
  product: webserver
description: The WordPress Issuu Plugin includes an arbitrary file disclosure vulnerability
  that allows unauthenticated attackers to disclose the content of local and remote
  files.
reference: 'Generated by converting Nuclei Template. Template ID: issuu-panel-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/issuu-panel/menu/documento/requests/ajax-docs.php
  selection-query-1:
    cs-uri-query:
      - abspath=%2Fetc%2Fpasswd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
