title: Oracle eBusiness Suite - Improper File Access
id: e21b3745-ef3b-4963-ba26-191de798acf3
status: experimental
logsource:
  product: webserver
description: 'Oracle eBusiness Suite is susceptible to improper file access vulnerabilities
  via bispgrapgh. Be aware this product is no longer supported with patches or security
  fixes.

  '
reference: 'Generated by converting Nuclei Template. Template ID: oracle-ebs-bispgrapgh-file-read
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: emenalf,tirtha_mandal,thomas_from_offensity; Converted
  to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /OA_HTML/bispgraph.jsp%0D%0A.js
      - /OA_HTML/jsp/bsc/bscpgraph.jsp
  selection-query-1:
    cs-uri-query:
      - ifn=passwd&ifl=/etc/
      - ifl=/etc/&ifn=passwd
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
