title: RockMongo 1.1.8 - Cross-Site Scripting
id: 65fbb561-479f-4606-b5e9-496431df8bd7
status: experimental
logsource:
  product: webserver
description: RockMongo 1.1.8 contains a cross-site scripting vulnerability which allows
  attackers to inject arbitrary JavaScript into the response returned by the application.
reference: 'Generated by converting Nuclei Template. Template ID: rockmongo-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: POST
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - action=login.index
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
