title: ThinkCMF - Remote Code Execution
id: ff47e393-9184-4007-907d-b77a403179e1
status: experimental
logsource:
  product: webserver
description: ThinkCMF is susceptible to remote code execution. An attacker can execute
  malware, obtain sensitive information, modify data, and/or gain full control over
  a compromised system without entering necessary credentials.
reference: 'Generated by converting Nuclei Template. Template ID: thinkcmf-arbitrary-code-execution
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - g=g&m=Door&a=index&content=<
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
