title: WP AutoSuggest 0.24 - SQL Injection
id: f9ea312c-3ea2-473f-b463-bfd25e37624e
status: experimental
logsource:
  product: webserver
description: 'The wp-autosuggest WordPress plugin was affected by an Unauthenticated
  SQL Injection security vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wp-autosuggest-sql-injection
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: theamanrawat; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/wp-autosuggest/autosuggest.php
  selection-query-1:
    cs-uri-query:
      - wpas_action=query&wpas_keys=1%27%29%2F%2A%2A%2FAND%2F%2A%2A%2F%28SELECT%2F%2A%2A%2F5202%2F%2A%2A%2FFROM%2F%2A%2A%2F%28SELECT%28SLEEP%286%29%29%29yRVR%29%2F%2A%2A%2FAND%2F%2A%2A%2F%28%27dwQZ%27%2F%2A%2A%2FLIKE%2F%2A%2A%2F%27dwQZ
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
