title: vBulletin Backdoor - Detect
id: 5766433c-3414-4e7b-8e02-051ffa52305d
status: experimental
logsource:
  product: webserver
description: 'Converted from a Nuclei template; ID: vbulletin-backdoor'
reference: 'Generated by converting Nuclei Template. Template ID: vbulletin-backdoor
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: MaStErCho; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /faq.php
      - /forum.php
      - /{{paths}}/faq.php
      - /{{paths}}/forum.php
  selection-query-1:
    cs-uri-query:
      - cmd=echo%20-n%20{{num}}|md5sum
      - x=shell_exec&y=echo%20-n%20{{num}}|md5sum
      - cmd=echo%20-n%20{{num}}|md5sum
      - x=shell_exec&y=echo%20-n%20{{num}}|md5sum
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
