title: NS ASG - Local File Inclusion
id: 3e2f262f-c6e3-4bf6-8c03-73cdac8c6cc2
status: experimental
logsource:
  product: webserver
description: NS ASG is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: nsasg-arbitrary-file-read
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu,ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /admin/cert_download.php
      - /admin/cert_download.php
  selection-query-1:
    cs-uri-query:
      - file=pqpqpqpq.txt&certfile=../../../../../../../../etc/passwd
      - file=pqpqpqpq.txt&certfile=cert_download.php
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
