title: WordPress Diarise 1.5.9 - Arbitrary File Retrieval
id: 83942b82-cce4-4817-aa23-362815536d93
status: experimental
logsource:
  product: webserver
description: WordPress Diarise theme version 1.5.9 suffers from a local file retrieval
  vulnerability.
reference: 'Generated by converting Nuclei Template. Template ID: diarise-theme-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/themes/diarise/download.php
  selection-query-1:
    cs-uri-query:
      - calendar=file:///etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
