title: WordPress mTheme-Unus Theme - Local File Inclusion
id: 649a0cb9-a986-471a-bd5c-4f5b37162791
status: experimental
logsource:
  product: webserver
description: WordPress mTheme-Unus Theme is vulnerable to local file inclusion via
  css.php.
reference: 'Generated by converting Nuclei Template. Template ID: mthemeunus-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/themes/mTheme-Unus/css/css.php
  selection-query-1:
    cs-uri-query:
      - files=../../../../wp-config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
