title: Dlink DSR-250 and Netgear Prosafe - Cross-Site Scripting
id: 4d8bf7b0-cabc-4331-87a2-7fdd36fa41dd
status: experimental
logsource:
  product: webserver
description: 'Dlink DSR-250 and Netgear Prosafe are vulnerable to reflected cross
  site scripting endpoint scgi-bin/platform.cgi in parameter SSLVPN.

  '
reference: 'Generated by converting Nuclei Template. Template ID: dlink-netgear-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: gtrrnr,vulnspace; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /scgi-bin/platform.cgi
  selection-query-1:
    cs-uri-query:
      - page=portalLogin.htm&portal=SSLVPN"><script>alert(document.domain)</script>
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
