title: Wordpress Wordfence - Cross-Site Scripting
id: 5dedfba2-4b75-4a5b-9632-f7269e0b8702
status: experimental
logsource:
  product: webserver
description: Wordpress Wordfence is vulnerable to cross-site scripting.
reference: 'Generated by converting Nuclei Template. Template ID: wordpress-wordfence-waf-bypass-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: hackergautam; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - s=ax6zt%2522%253e%253cscript%253ealert%2528document.domain%2529%253c%252fscript%253ey6uu6
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
