title: YonYou KSOA common/dept.jsp - SQL injection
id: b11fcc3a-721a-43c3-b83e-c17c945908f2
status: experimental
logsource:
  product: webserver
description: 'Yonyou KSOA contains a SQL injection vulnerability. An attacker can
  possibly obtain sensitive information from a database, modify data, and execute
  unauthorized administrative operations in the context of the affected site.

  '
reference: 'Generated by converting Nuclei Template. Template ID: yonyou-ksoa-dept-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /common/dept.jsp
  selection-query-1:
    cs-uri-query:
      - deptid=1'+UNION+ALL+SELECT+60%2Csys.fn_sqlvarbasetostr(HASHBYTES('MD5'%2C'{{num}}'))--+
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
