title: Next.js <1.2.3 - Open Redirect
id: a462f57e-8107-4840-890e-48051d392261
status: experimental
logsource:
  product: webserver
description: "Next.js contains an open redirect via \u201C_next/image\u201D due to\
  \ improper path parsing."
reference: 'Generated by converting Nuclei Template. Template ID: nextjs-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /_next/image
  selection-query-1:
    cs-uri-query:
      - url=/\/\interact.sh/&q=100&w=128&h=128
  selection-status-code-1:
    sc-status: 308
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
