title: WordPress Finder - Cross-Site Scripting
id: b63c767a-8e83-4941-939b-20f31d6a6b86
status: experimental
logsource:
  product: webserver
description: WordPress Plugin Finder contains a cross-site scripting vulnerability
  via the order parameter. An attacker can execute arbitrary script in the browser
  of an unsuspecting user in the context of the affected site. This can allow the
  attacker to steal cookie-based authentication credentials and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: wp-finder-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: daffainfo; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/finder/index.php
  selection-query-1:
    cs-uri-query:
      - by=type&dir=tv&order=%22%3E%3C%2Fscript%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
