title: PACSOne Server 6.6.2 - Local File Inclusion
id: 6eb5343a-aefe-4699-a482-f8b6edef6f3c
status: experimental
logsource:
  product: webserver
description: PACSOne Server 6.6.2 is vulnerable to local file inclusion via its integrated
  DICOM Web Viewer.
reference: 'Generated by converting Nuclei Template. Template ID: pacsone-server-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /pacsone/nocache.php
  selection-query-1:
    cs-uri-query:
      - path=..%2f..%2f..%2f..%2f..%2f..%2f..%2f..%2f..%2f..%2fetc%2f.%2fzpx%2f..%2fpasswd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
