title: Webigniter 28.7.23 - Cross-Site Scripting
id: 8079a753-c39c-4eda-be14-f71ed00c0cd4
status: experimental
logsource:
  product: webserver
description: 'The value of the redirect request parameter is copied into the value
  of an HTML tag attribute which is encapsulated in double quotation marks. The payload
  ycsz3"><script>alert(1)</script>bn76w was submitted in the redirect parameter. This
  input was echoed unmodified in the application''s response. By using this Java Script
  injection, the attacker can trick a lot of users into visiting his dangerous URL
  which is reflected on the login form, before they log in, warning them that there
  is a problem with the login

  '
reference: 'Generated by converting Nuclei Template. Template ID: webigniter-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: theamanrawat; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /cms/login
      - /login
  selection-query-1:
    cs-uri-query:
      - redirect=cmsycsz3%22%3E%3Cscript%3Ealert%28document.domain%29%3C%2fscript>bn76w
      - redirect=cmsycsz3%22%3E%3Cscript%3Ealert%28document.domain%29%3C%2fscript>bn76w
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
