title: WordPress Brandfolder - Open Redirect (RFI & LFI)
id: 7a36cba9-61f8-46e6-bd49-c65bf72748c7
status: experimental
logsource:
  product: webserver
description: 'WordPress Brandfolder is vulnerable to remote/local file inclusion and
  allows remote attackers to inject an arbitrary URL into the ''callback.php'' endpoint
  via the ''wp_abspath'' parameter which will redirect the victim to it.

  '
reference: 'Generated by converting Nuclei Template. Template ID: brandfolder-open-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/brandfolder/callback.php
  selection-query-1:
    cs-uri-query:
      - wp_abspath=https://interact.sh/
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
