title: Softneta MedDream PACS Server Premium 6.7.1.1 - Local File Inclusion
id: 011387e4-aef9-47d8-a4f1-4df35a18a1a6
status: experimental
logsource:
  product: webserver
description: Softneta MedDream PACS Server Premium 6.7.1.1 is vulnerable to local
  file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: sofneta-mecdream-pacs-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /pacs/nocache.php
  selection-query-1:
    cs-uri-query:
      - path=%5c%2e%2e%5c%2e%2e%5c%2e%2e%5c%2e%2e%5c%2e%2e%5c%2e%2e%5cWindows%5cwin.ini
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
