title: Microweber Cross-Site Scripting
id: 97bed8a1-9f68-4654-97b9-3a78aad83abc
status: experimental
logsource:
  product: webserver
description: Microweber prior to 1.2.11 is susceptible to reflected cross-site Scripting
  via Packagist microweber/microweber.
reference: 'Generated by converting Nuclei Template. Template ID: microweber-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: gy741; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /editor_tools/module
  selection-query-1:
    cs-uri-query:
      - type=files/admin"><script>alert(document.domain)</script>&params=filetype=images#path=
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
