title: Nuxt.js Error Page - Cross-Site Scripting
id: 542c4875-3534-480a-a835-3e11de90f1c0
status: experimental
logsource:
  product: webserver
description: 'The developer server unsafely renders the stack trace within errors.
  This can be manipulated by sending a specially crafted request.

  '
reference: 'Generated by converting Nuclei Template. Template ID: nuxt-js-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /__nuxt_error
  selection-query-1:
    cs-uri-query:
      - stack=%0A{{url_encode(payload)}}
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
