title: EPP Server - Local File Inclusion
id: cdd73b3f-8094-4fe8-986b-645adfb91bb9
status: experimental
logsource:
  product: webserver
description: 'servlet called "CitiesServlet" that handles HTTP GET requests, so the
  user-provided input, obtained from the country parameter, is directly concatenated
  with the "/cities/cities_" string to form the fileName, This means an attacker can
  manipulate the country parameter and potentially access arbitrary files on the server''s
  file system

  '
reference: 'Generated by converting Nuclei Template. Template ID: epp-server-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /cities
  selection-query-1:
    cs-uri-query:
      - country=/../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
