title: Hrsale 2.0.0 - Local File Inclusion
id: 6d0b60e9-d471-444c-a1ac-82019ecda59c
status: experimental
logsource:
  product: webserver
description: Hrsale 2.0.0 is vulnerable to local file inclusion. This exploit allow
  you to download any readable file from server without permission and login session
reference: 'Generated by converting Nuclei Template. Template ID: hrsale-unauthenticated-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /download
  selection-query-1:
    cs-uri-query:
      - type=files&filename=../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
