title: WordPress Ultimate Member <2.1.7 - Open Redirect
id: bfcb6592-bac0-43db-8278-bd8f8f0f29bf
status: experimental
logsource:
  product: webserver
description: WordPress Ultimate Member plugin before 2.1.7 contains an open redirect
  vulnerability on the registration and login pages via the "redirect_to" GET parameter.
  An attacker can redirect a user to a malicious site and possibly obtain sensitive
  information, modify data, and/or execute unauthorized operations.
reference: 'Generated by converting Nuclei Template. Template ID: ultimatemember-open-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /register/
  selection-query-1:
    cs-uri-query:
      - redirect_to=https://interact.sh/
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
