title: Landray EIS - SQL Injection
id: 6249957b-0b3f-49e4-be61-ae5fae9d5406
status: experimental
logsource:
  product: webserver
description: 'Landray''s smart collaboration platform EIS has a very rich collection
  of modules to meet the needs of organizations and enterprises in knowledge, collaboration,
  and project management system construction. There is a SQL injection vulnerability
  in the rpt_listreport_definefield.aspx interface of Landray EIS smart collaboration
  platform

  '
reference: 'Generated by converting Nuclei Template. Template ID: landray-eis-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /SM/rpt_listreport_definefield.aspx
  selection-query-1:
    cs-uri-query:
      - ID=2%20and%201=@@version--+
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
