title: Kingdee EAS - Local File Inclusion
id: 8992e971-71f2-4486-9883-ecc348530228
status: experimental
logsource:
  product: webserver
description: Kingdee EAS OA server_file is vulnerable to local file inclusion and
  can allow attackers to obtain sensitive server information.
reference: 'Generated by converting Nuclei Template. Template ID: kingdee-eas-directory-traversal
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /appmonitor/protected/selector/server_file/files
      - /appmonitor/protected/selector/server_file/files
  selection-query-1:
    cs-uri-query:
      - folder=C://&suffix=
      - folder=/&suffix=
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
