title: Nginx Server - Local File Inclusion
id: 6867c747-4d84-4835-a961-1d2fbd7bf37c
status: experimental
logsource:
  product: webserver
description: Nginx server is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: nginx-merge-slashes-path-traversal
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - ///////../../../etc/passwd
      - /static///////../../../../etc/passwd
      - ///../app.js
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
