title: WordPress Oxygen-Theme - Local File Inclusion
id: 90423cde-5ce2-4eb5-bd13-b80247e4e688
status: experimental
logsource:
  product: webserver
description: WordPress Oxygen-Theme has a local file inclusion vulnerability via the
  'file' parameter of 'download.php'.
reference: 'Generated by converting Nuclei Template. Template ID: wp-oxygen-theme-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/themes/oxygen-theme/download.php
  selection-query-1:
    cs-uri-query:
      - file=../../../wp-config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
