title: WordPress tutor 1.5.3 - Local File Inclusion
id: ef1f97c6-d9b9-4abb-acf5-fe914ea671c3
status: experimental
logsource:
  product: webserver
description: WordPress tutor.1.5.3 is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: wp-tutor-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x240x23elu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/tutor/views/pages/instructors.php
  selection-query-1:
    cs-uri-query:
      - sub_page=/etc/passwd
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
