title: WordPress Aspose Importer & Exporter 1.0 - Local File Inclusion
id: 0005911e-930a-4e2a-a462-150fbdbc693c
status: experimental
logsource:
  product: webserver
description: WordPress Aspose Importer & Exporter version 1.0 is vulnerable to local
  file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: aspose-ie-file-download
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/aspose-importer-exporter/aspose_import_export_download
  selection-query-1:
    cs-uri-query:
      - file=../../../wp-config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
