title: Secure Access Gateway SecSSLVPN - Authentication Bypass
id: e6d864d5-0e78-4b9f-aa54-251b3db60ae4
status: experimental
logsource:
  product: webserver
description: 'The Secure Access Gateway SecSSL 3600 secure access gateway system has
  an unauthorized access vulnerability. An attacker can obtain the user list and modify
  the user account password through the vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: secsslvpn-auth-bypass
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /admin/group/x_group.php
  selection-query-1:
    cs-uri-query:
      - id=1
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
