title: FE collaborative Office templateOfTaohong_manager.jsp  - Path Traversal
id: 8584dcae-a397-4b65-a533-217849948258
status: experimental
logsource:
  product: webserver
description: 'There is a directory traversal vulnerability in the templateOfTaohong_manager.jsp
  file of UFIDA FE collaborative office platform. Through the vulnerability, attackers
  can obtain directory files and other information, leading to further attacks.

  '
reference: 'Generated by converting Nuclei Template. Template ID: yonyou-fe-directory-traversal
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /system/mediafile/templateOfTaohong_manager.jsp
  selection-query-1:
    cs-uri-query:
      - path=/../../../
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
