title: SeaCMS V6.4.5 RCE
id: 7f257855-c4ab-40eb-9815-243e6a2b84bb
status: experimental
logsource:
  product: webserver
description: A vulnerability in SeaCMS allows remote unauthenticated attackers to
  execute arbitrary PHP code.
reference: 'Generated by converting Nuclei Template. Template ID: seacms-rce Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: POST
  selection-paths-1:
    cs-uri-stem:
      - /search.php
  selection-query-1:
    cs-uri-query:
      - searchtype=5
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
