title: Qizhi Fortressaircraft Unauthorized Access
id: fcacc470-22d8-4a0c-a966-a707017e538e
status: experimental
logsource:
  product: webserver
description: Qizhi Fortressaircraft is vulnerable to Unauthorized Access.
reference: 'Generated by converting Nuclei Template. Template ID: qizhi-fortressaircraft-unauth
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /audit/gui_detail_view.php
  selection-query-1:
    cs-uri-query:
      - token=1&id=%5C&uid=%2Cchr(97))%20or%201:%20print%20chr(121)%2bchr(101)%2bchr(115)%0d%0a%23&login=shterm
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
