title: Concrete CMS <8.5.2 - Cross-Site Scripting
id: 63bb7143-d70c-46bc-97b5-66ec769312a5
status: experimental
logsource:
  product: webserver
description: Concrete CMS before 8.5.2 contains a cross-site scripting vulnerability
  in preview_as_user function using cID parameter.
reference: 'Generated by converting Nuclei Template. Template ID: concrete-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: shifacyclewla,hackergautam,djoevanka; Converted to
  Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /ccm/system/panels/page/preview_as_user/preview
  selection-query-1:
    cs-uri-query:
      - cID="></iframe><svg/onload=alert("{{randstr}}")>
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
