title: Arcade.php - SQL Injection
id: 5030eb9a-f1da-4dc5-9345-e9447363544e
status: experimental
logsource:
  product: webserver
description: 'The arcade.php script is vulnerable to SQL injection. By exploiting
  this vulnerability, an attacker can manipulate the SQL queries executed by the script,
  potentially gaining unauthorized access to the database.

  '
reference: 'Generated by converting Nuclei Template. Template ID: arcade-php-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: MaStErChO; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /arcade.php
  selection-query-1:
    cs-uri-query:
      - act=Arcade&do=stats&comment=a&s_id=1'
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
