title: ThinkPHP 5.0.1 - Remote Code Execution
id: 92c8f68e-f050-416c-b801-b0e0e6669729
status: experimental
logsource:
  product: webserver
description: ThinkPHP 5.0.1 allows remote unauthenticated attackers to  execute arbitrary
  code via the 's' parameter.
reference: 'Generated by converting Nuclei Template. Template ID: thinkphp-501-rce
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: lark-lab; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: POST
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - s=index/index/index
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
