title: Qcubed - Cross-Site Scripting
id: 21538a6e-2acd-4edb-9f4f-cb79497afacf
status: experimental
logsource:
  product: webserver
description: Qcubed contains a cross-site scripting vulnerability which allows a remote
  attacker to inject arbitrary JavaScript via the /assets/php/_devtools/installer/step_2.php
  endpoint and the installation_path parameter.
reference: 'Generated by converting Nuclei Template. Template ID: qcubed-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /assets/php/_devtools/installer/step_2.php
      - /qcubed/assets/php/_devtools/installer/step_2.php
  selection-query-1:
    cs-uri-query:
      - installation_path=%22%3E%3C%2Fscript%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
      - installation_path=%22%3E%3C%2Fscript%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
