title: Dicoogle PACS 2.5.0 - Local File Inclusion
id: 507eb4b5-64f0-4b7e-8a5a-12a1ff4cee22
status: experimental
logsource:
  product: webserver
description: Dicoogle PACS 2.5.0 is vulnerable to local file inclusion. This allows
  an attacker to read arbitrary files that the web user has access to. Admin credentials
  aren't required.
reference: 'Generated by converting Nuclei Template. Template ID: dicoogle-pacs-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /exportFile
  selection-query-1:
    cs-uri-query:
      - UID=..%5c..%5c..%5c..%5c..%5c..%5c..%5c..%5c..%5c..%5c..%5c..%5c..%5c..%5c..%5c..%5cwindows%5cwin.ini
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
