title: Khodrochi CMS - Cross Site Scripting
id: 90dcf441-7c53-4e31-b213-631bd75cbaba
status: experimental
logsource:
  product: webserver
description: 'A cross site scripting vulnerability was found in the Khodrochi.ir CMS
  an Iranian Car Services Platform.

  '
reference: 'Generated by converting Nuclei Template. Template ID: khodrochi-cms-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /specification/report.php
  selection-query-1:
    cs-uri-query:
      - q=%22%3E%3Cimg%20src=x%20onerror=prompt(document.domain)%3E
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
