title: SOUND4 IMPACT/FIRST/PULSE/Eco <=2.x (PHPTail) Unauthenticated File Disclosure
id: ae79b4a2-cb49-4ff4-8bd6-4204d9bfe7f8
status: experimental
logsource:
  product: webserver
description: 'The application suffers from an unauthenticated file disclosure vulnerability.
  Using the ''file'' GET parameter attackers can disclose arbitrary files on the affected
  device and disclose sensitive and system information.

  '
reference: 'Generated by converting Nuclei Template. Template ID: sound4-file-disclosure
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: arafatansari; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /cgi-bin/loghandler.php
  selection-query-1:
    cs-uri-query:
      - ajax=251&file=/mnt/old-root/etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
