title: WordPress Aspose PDF Exporter - Local File Inclusion
id: 22f46530-e126-4611-bc21-def474101a46
status: experimental
logsource:
  product: webserver
description: WordPress Aspose PDF Exporter is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: aspose-pdf-file-download
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/Wordpress/Aaspose-pdf-exporter/aspose_pdf_exporter_download.php
  selection-query-1:
    cs-uri-query:
      - file=../../../wp-config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
