title: WordPress Plugin WPML Version < 4.6.1 Cross-Site Scripting
id: 7c999d1b-3df9-4945-afc3-f0feaa29e47a
status: experimental
logsource:
  product: webserver
description: 'WordPress Plugin WPML Version < 4.6.1  is vulnerable to RXSS via wp_lang
  parameter.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wpml-xss Refer the
  templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: bugvsme; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-login.php
  selection-query-1:
    cs-uri-query:
      - wp_lang=en_US%27
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
