title: DEOS OPEN 500EMS Controller - Admin Exposure
id: 60b961d3-f3f6-425f-bb91-81286e9570c0
status: experimental
logsource:
  product: webserver
description: 'The DEOS OPEN 500EMS controller exposes administrative functions without
  authentication.

  '
reference: 'Generated by converting Nuclei Template. Template ID: deos-open500ems-panel
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: sullo; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /cgi-bin/cosmobdf.cgi
      - /cgi-bin/cosmobdf.cgi
  selection-query-1:
    cs-uri-query:
      - function=0
      - function=1
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
