title: Dahua Smart Park Management Platform - Arbitary File Read
id: bcc2b02b-1c60-4fbe-9569-c0db011b4d55
status: experimental
logsource:
  product: webserver
description: Dahua Smart Park Management Platform is vulnerable to Local File Inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: dahua-wpms-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /portal/itc/attachment_downloadByUrlAtt.action
  selection-query-1:
    cs-uri-query:
      - filePath=file:/etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
