title: Webp server go - Local File Inclusion
id: dc6fdf6b-8ac0-4637-8a27-bc0fddf5b648
status: experimental
logsource:
  product: webserver
description: Webp server go is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: webp-server-go-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /%252e%252e%252f%252e%252e%252f%252e%252e%252f%252e%252e%252f%252e%252e%252f%252e%252e%252f%252e%252e%252f%252e%252e%252f%252e%252e%252f%252e%252e%252f%252e%252e%252fetc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
