title: Wordpress Brandfolder - Remote/Local File Inclusion
id: bccde121-986c-41c4-bb8a-9a70220ef83d
status: experimental
logsource:
  product: webserver
description: WordPress Brandfolder allows remote attackers to access arbitrary files
  that reside on the local and remote server and disclose their content.
reference: 'Generated by converting Nuclei Template. Template ID: brandfolder-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/brandfolder/callback.php
  selection-query-1:
    cs-uri-query:
      - wp_abspath=../../../wp-config.php%00
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
