title: Cherry Plugin < 1.2.7 - Arbitrary File Retrieval and File Upload
id: b3c9ca0a-4400-4c47-8803-ec2de9adf075
status: experimental
logsource:
  product: webserver
description: WordPress plugin Cherry < 1.2.7 contains an unauthenticated file upload
  and download vulnerability, allowing attackers to upload and download arbitrary
  files. This could result in attacker uploading backdoor shell scripts or downloading
  the wp-config.php file.
reference: 'Generated by converting Nuclei Template. Template ID: cherry-file-download
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/cherry-plugin/admin/import-export/download-content.php
  selection-query-1:
    cs-uri-query:
      - file=../../../../../wp-config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
