title: GoIP-1 GSM - Local File Inclusion
id: c1119057-b9f0-48b3-8df7-66a22355c75d
status: experimental
logsource:
  product: webserver
description: GoIP-1 GSM is vulnerable to local file inclusion because input passed
  thru the 'content' or 'sidebar' GET parameter in 'frame.html' or 'frame.A100.html'
  is not properly sanitized before being used to read files. This can be exploited
  by an unauthenticated attacker to read arbitrary files on the affected system.
reference: 'Generated by converting Nuclei Template. Template ID: goip-1-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: gy741; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /default/en_US/frame.html
      - /default/en_US/frame.A100.html
  selection-query-1:
    cs-uri-query:
      - content=..%2f..%2f..%2f..%2f..%2f..%2f..%2fetc%2fpasswd
      - sidebar=..%2f..%2f..%2f..%2f..%2f..%2f..%2fetc%2fpasswd
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
