title: Social Metrics Tracker <= 1.6.8 - Unauthorised Data Export
id: abc05449-df44-48af-82b8-cf85404d1869
status: experimental
logsource:
  product: webserver
description: 'The lack of proper authorisation when exporting data from the plugin
  could allow unauthenticated users to get information about the posts and page of
  the blog, including their author''s username and email.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wordpress-social-metrics-tracker
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: randomrobbie; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-admin/admin-ajax.php
  selection-query-1:
    cs-uri-query:
      - page=social-metrics-tracker-export&smt_download_export_file=1
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
