title: Let's Encrypt - Cross-Site Scripting
id: 5e25f2f2-9092-49e7-8a49-0998a3cf8a42
status: experimental
logsource:
  product: webserver
description: Let's Encrypt contains a cross-site scripting vulnerability when using
  the the ACME protocol to issue SSL certificates.
reference: 'Generated by converting Nuclei Template. Template ID: acme-xss Refer the
  templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pdteam; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /.well-known/acme-challenge/%3C%3fxml%20version=%221.0%22%3f%3E%3Cx:script%20xmlns:x=%22http://www.w3.org/1999/xhtml%22%3Ealert%28document.domain%26%23x29%3B%3C/x:script%3E
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and not filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
