title: WordPress Eatery 2.2 - Open Redirect
id: 85a162da-4775-4d47-a33c-2c434b0f5df7
status: experimental
logsource:
  product: webserver
description: 'WordPress Eatery theme 2.2 contains an open redirect vulnerability.
  The theme accepts a user-controlled input that specifies a link to an external site.
  An attacker can redirect a user to a malicious site and possibly obtain sensitive
  information, modify data, and/or execute unauthorized operations.

  '
reference: 'Generated by converting Nuclei Template. Template ID: eatery-restaurant-open-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/themes/eatery/nav.php
  selection-query-1:
    cs-uri-query:
      - -Menu-=https://interact.sh/
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
