title: WordPress Church Admin 0.33.2.1 - Local File Inclusion
id: fb437366-e3cd-4aa8-9246-ee6864923e34
status: experimental
logsource:
  product: webserver
description: WordPress Church Admin 0.33.2.1 is vulnerable to local file inclusion
  via the "key" parameter of plugins/church-admin/display/download.php.
reference: 'Generated by converting Nuclei Template. Template ID: church-admin-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/church-admin/display/download.php
  selection-query-1:
    cs-uri-query:
      - key=../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
