title: IceWarp - Open Redirect
id: 43dafa6e-6963-4480-af3e-5a1bbd291a5e
status: experimental
logsource:
  product: webserver
description: IceWarp open redirect vulnerabilities were detected. An attacker can
  redirect a user to a malicious site and possibly obtain sensitive information, modify
  data, and/or execute unauthorized operations.
reference: 'Generated by converting Nuclei Template. Template ID: icewarp-open-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: uomogrande; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - ///interact.sh/%2F..
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and not filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
