title: Gnuboard 5 - Cross-Site Scripting
id: 2182ae9b-be35-47b1-8281-db490efbba31
status: experimental
logsource:
  product: webserver
description: 'Gnuboard 5 contains a cross-site scripting vulnerability via the clean_xss_tags()
  function called in new.php.

  '
reference: 'Generated by converting Nuclei Template. Template ID: gnuboard5-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: arafatansari; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /bbs/new.php
  selection-query-1:
    cs-uri-query:
      - darkmode=%22%3E%3Cscript%3Ealert(document.domain)%3C/script%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
