title: Chanjet Tplus - Unauthorized Password Reset
id: 8e8724e6-c3a3-4143-ad59-68e2af36eaab
status: experimental
logsource:
  product: webserver
description: 'There is an unauthorized administrator password modification vulnerability
  in UF Chanjet T+ RecoverPassword.aspx. An attacker can use this vulnerability to
  modify the administrator account password to log in to the backend.

  '
reference: 'Generated by converting Nuclei Template. Template ID: chanjet-tplus-unauth-passreset
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0xr2r; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /tplus/ajaxpro/RecoverPassword,App_Web_recoverpassword.aspx.cdcab7d2.ashx
      - /tplus/ajaxpro/RecoverPassword,App_Web_recoverpassword.aspx.cdcab7d2.ashx
  selection-query-1:
    cs-uri-query:
      - method={{randbase(6)}}
      - method=SetNewPwd
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
