title: Wordpress - Path Disclosure
id: 54a83559-a2ef-4074-929a-939d0403515f
status: experimental
logsource:
  product: webserver
description: Wordpress internal file system path of a WordPress installation is exposed
  or disclosed to unauthorized users.
reference: 'Generated by converting Nuclei Template. Template ID: wp-full-path-disclosure
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: arcc; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-includes/rss-functions.php
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and not filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
