title: OrbiTeam BSCW Server - Local File Inclusion
id: b2686448-7c57-48aa-af88-3722b4a5dbe2
status: experimental
logsource:
  product: webserver
description: 'OrbiTeam BSCW Server versions 5.0.x, 5.1.x, 5.2.4 and below, 7.3.x and
  below, and 7.4.3 and below are vulnerable to unauthenticated local file inclusion.

  '
reference: 'Generated by converting Nuclei Template. Template ID: orbiteam-bscw-server-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /pub/bscw.cgi/30
  selection-query-1:
    cs-uri-query:
      - op=theme&style_name=../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
