title: EWEBS - Local File Inclusion
id: 6cb50d8f-3942-4db0-83b5-6873c99638b6
status: experimental
logsource:
  product: webserver
description: EWEBS is vulnerable to local file inclusion and allows remote attackers
  to disclose the content of locally stored files via the 'Language_S' parameter supplied
  to the 'casmain.xgi' endpoint.
reference: 'Generated by converting Nuclei Template. Template ID: ewebs-arbitrary-file-reading
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: POST
  selection-paths-1:
    cs-uri-stem:
      - /casmain.xgi
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
