title: Wordpress HB Audio Gallery Lite - Local File Inclusion
id: ff113838-0d3c-464f-8124-ef8eeec75ad0
status: experimental
logsource:
  product: webserver
description: Wordpress HB Audio Gallery Lite is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: hb-audio-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/hb-audio-gallery-lite/gallery/audio-download.php
  selection-query-1:
    cs-uri-query:
      - file_path=../../../../wp-config.php&file_size=10
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
