title: SquirrelMail Address Add 1.4.2 - Cross-Site Scripting
id: 3e1df899-0bcd-40d3-8132-470fb8c3d9e1
status: experimental
logsource:
  product: webserver
description: SquirrelMail Address Add 1.4.2 plugin contains a cross-site scripting
  vulnerability. It fails to properly sanitize user-supplied input, thus allowing
  an attacker to execute arbitrary script in the browser of an unsuspecting user in
  the context of the affected site. This can allow the attacker to steal cookie-based
  authentication credentials and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: squirrelmail-address-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /plugins/address_add/add.php
  selection-query-1:
    cs-uri-query:
      - first=HOVER%20ME!%3C%2Fscript%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
