title: Voyager 1.3.0 - Directory Traversal
id: 20632f30-1496-4369-8298-d3e81482efa9
status: experimental
logsource:
  product: webserver
description: 'Voyager 1.3.0 is vulnerable to local file inclusion.

  '
reference: 'Generated by converting Nuclei Template. Template ID: voyager-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: mammad_rahimzada; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /admin/voyager-assets
  selection-query-1:
    cs-uri-query:
      - path=.....%2F%2F%2F.....%2F%2F%2F.....%2F%2F%2F.....%2F%2F%2F.....%2F%2F%2F.....%2F%2F%2F.....%2F%2F%2F.....%2F%2F%2F.....%2F%2F%2Fetc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
