title: OA E-Weaver SignatureDownLoad - Arbitrary File Read
id: 70616ce9-c7f6-4347-9c0a-bb2549c53daf
status: experimental
logsource:
  product: webserver
description: 'There is an arbitrary file reading vulnerability in the E-Weaver SignatureDownLoad
  interface of Panwei OA. An attacker can read any file on the server through the
  vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: weaver-signaturedownload-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /weaver/weaver.file.SignatureDownLoad
  selection-query-1:
    cs-uri-query:
      - markId=0%20union%20select%20%27../ecology/WEB-INF/prop/weaver.properties%27
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
