title: PMB 5.6 - Local File Inclusion
id: 4c777221-8b9a-4f55-be4d-4f03990608ba
status: experimental
logsource:
  product: webserver
description: PMB 5.6 is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: pmb-local-file-disclosure
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /pmb/opac_css/getgif.php
  selection-query-1:
    cs-uri-query:
      - chemin=../../../../../../etc/passwd&nomgif={{rand_base(4)}}
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
