title: WordPress Download Shortcode 0.2.3 - Local File Inclusion
id: c016ed91-a043-487e-b428-0999108ec167
status: experimental
logsource:
  product: webserver
description: WordPress Download Shortcode 0.2.3 is prone to a local file inclusion
  vulnerability because it fails to sufficiently sanitize user-supplied input. Exploiting
  this issue may allow an attacker to obtain sensitive information that could aid
  in further attacks. Prior versions may also be affected.
reference: 'Generated by converting Nuclei Template. Template ID: shortcode-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/force-download.php
  selection-query-1:
    cs-uri-query:
      - file=../wp-config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
