title: WSO2 <5.8.0 - Server Side Request Forgery
id: e4986441-5827-4839-84d3-0f1bcccbf48d
status: experimental
logsource:
  product: webserver
description: 'WSO2 prior to version 5.8.0 is susceptible to a server-side request
  forgery vulnerability. This vulnerability can be exploited by misusing the UI gadgets
  loading capability of the shindig web application. An attacker can alter a specific
  URL in the request causing the server to initiate a GET request to the altered URL.

  '
reference: 'Generated by converting Nuclei Template. Template ID: WSO2-2019-0598 Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: Amnotacat; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /shindig/gadgets/proxy
  selection-query-1:
    cs-uri-query:
      - container=default&url=http://oast.pro
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
