title: Weaver E-Cology JqueryFileTree - Directory Traversal
id: 4e86c7be-0ada-48fa-88f5-d875d0e06ecc
status: experimental
logsource:
  product: webserver
description: 'Panwei OA E-Cology jqueryFileTree.jsp directory traversal vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: ecology-jqueryfiletree-traversal
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /hrm/hrm_e9/orgChart/js/jquery/plugins/jqueryFileTree/connectors/jqueryFileTree.jsp
  selection-query-1:
    cs-uri-query:
      - dir=/page/resource/userfile/../../
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
