title: WordPress Setup Configuration
id: 3bfb3bf8-4843-481d-8feb-207813225d27
status: experimental
logsource:
  product: webserver
description: Exposed Wordpress Setup Configuration.
reference: 'Generated by converting Nuclei Template. Template ID: wp-config-setup
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-admin/setup-config.php
  selection-query-1:
    cs-uri-query:
      - step=1
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
