title: Copyparty v1.8.6 - Cross-Site Scripting
id: cc03c552-b029-470c-8ac5-ac3016b04cf6
status: experimental
logsource:
  product: webserver
description: 'Copyparty is a portable file server. Versions prior to 1.8.6 are subject
  to a reflected cross-site scripting (XSS) Attack. The vulnerability in the application''s
  web interface could allow an attacker to execute malicious javascript code by tricking
  users into accessing a malicious link.

  '
reference: 'Generated by converting Nuclei Template. Template ID: copyparty-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: theamanrawat; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - hc=%22%3E%3Cscript%3Ealert(document.domain)%3C/script%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
