title: Hanta Internet Behavior Management System - Remote Code Execution
id: fc081abd-6ec4-4d9d-8539-cd76c7309d6f
status: experimental
logsource:
  product: webserver
description: Hanta Internet Behavior Management System is vulnerable to RCE.
reference: 'Generated by converting Nuclei Template. Template ID: hanta-rce Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: momika233; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /dgn/dgn_tools/ping.php
  selection-query-1:
    cs-uri-query:
      - ipdm=2;id;
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
