title: WordPress WPtouch 3.x - Open Redirect
id: 97d2ef8e-7a0c-4d71-aebe-886f87cd8bb0
status: experimental
logsource:
  product: webserver
description: 'WordPress WPtouch plugin 3.x contains an open redirect vulnerability.
  The plugin fails to properly sanitize user-supplied input. An attacker can redirect
  a user to a malicious site and possibly obtain sensitive information, modify data,
  and/or execute unauthorized operations.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wptouch-open-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - wptouch_switch=desktop&redirect=https://interact.sh/
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
