title: ZCMS - SQL Injection
id: aec705a3-1e39-4d86-80df-d08156cea5f8
status: experimental
logsource:
  product: webserver
description: ZCMS contains a SQL injection vulnerability. An attacker can possibly
  obtain sensitive information from a database, modify data, and execute unauthorized
  administrative operations in the context of the affected site.
reference: 'Generated by converting Nuclei Template. Template ID: zcms-v3-sqli Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /admin/cms_channel.php
  selection-query-1:
    cs-uri-query:
      - del=123456+AND+(SELECT+1+FROM(SELECT+COUNT(*)%2cCONCAT(0x7e%2cmd5({{num}})%2c0x7e%2cFLOOR(RAND(0)*2))x+FROM+INFORMATION_SCHEMA.CHARACTER_SETS+GROUP+BY+x)a)--%2b'
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
