title: WordPress Upward Themes <1.5 - Open Redirect
id: 1e7c94f9-1982-4172-a197-b48dc70cc5f9
status: experimental
logsource:
  product: webserver
description: 'WordPress Upward Themes 1.5 accepts a user-controlled input that specifies
  a link to an external site, and uses that link in a Redirect. This simplifies phishing
  attacks. An http parameter may contain a URL value and could cause the web application
  to redirect the request to the specified URL. By modifying the URL value to a malicious
  site, an attacker may successfully launch a phishing scam and steal user credentials.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wp-upward-theme-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/themes/Upward/go.php
  selection-query-1:
    cs-uri-query:
      - https://interact.sh
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
