title: SolarView Compact 6.00 - Cross-Site Scripting
id: a448b1e4-b280-48c6-815b-b3683b3a55ab
status: experimental
logsource:
  product: webserver
description: 'SolarView Compact 6.00 contains a cross-site scripting vulnerability
  via fname at /Solar_Image.php.

  '
reference: 'Generated by converting Nuclei Template. Template ID: solarview-compact-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /Solar_Image.php
  selection-query-1:
    cs-uri-query:
      - mode=resize&fname=test%22%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
