title: HTTPBin - Open Redirect
id: 3691172b-a28c-456b-af2f-8085dce6148d
status: experimental
logsource:
  product: webserver
description: HTTPBin contains an open redirect vulnerability. An attacker can redirect
  a user to a malicious site and possibly obtain sensitive information, modify data,
  and/or execute unauthorized operations.
reference: 'Generated by converting Nuclei Template. Template ID: httpbin-open-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: Adam Crosser; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /redirect-to
  selection-query-1:
    cs-uri-query:
      - url=https%3A%2F%2Finteract.sh
  selection-status-code-1:
    sc-status: 302
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
