title: Qibocms - Arbitrary File Download
id: ae2b1b8b-c052-43b4-b397-161cafbc1585
status: experimental
logsource:
  product: webserver
description: Qibocms is vulnerable to arbitrary file download vulnerability.
reference: 'Generated by converting Nuclei Template. Template ID: qibocms-file-download
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: theabhinavgaur; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /do/job.php
  selection-query-1:
    cs-uri-query:
      - job=download&url=ZGF0YS9jb25maWcucGg8
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
