title: Wordpress W3C Total Cache <= 0.9.4 - Server Side Request Forgery (SSRF)
id: a8849c14-5b7a-4da5-9f7a-ef4529202162
status: experimental
logsource:
  product: webserver
description: 'The W3 Total Cache WordPress plugin was affected by an Unauthenticated
  Server Side Request Forgery (SSRF) security vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: w3c-total-cache-ssrf
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: random_robbie; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/w3-total-cache/pub/minify.php
  selection-query-1:
    cs-uri-query:
      - file=yygpKbDS1y9Ky9TLSy0uLi3Wyy9KB3NLKkqUM4CyxUDpxKzECr30_Pz0nNTEgsxiveT8XAA.css
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
