title: UFIDA NC Portal - Arbitrary File Read
id: 8747341c-d3b2-4444-9684-5d4bfa4fd87b
status: experimental
logsource:
  product: webserver
description: 'There is any file reading in the getFileLocal interface of UFIDA Mobile
  System Management.

  '
reference: 'Generated by converting Nuclei Template. Template ID: yonyou-ufida-nc-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /portal/file
  selection-query-1:
    cs-uri-query:
      - cmd=getFileLocal&fileid=..%2F..%2F..%2F..%2Fwebapps/nc_web/WEB-INF/web.xml
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
