title: SiteMinder - DOM Cross-Site Scripting
id: b8426469-aa30-4da4-853e-79140dba0075
status: experimental
logsource:
  product: webserver
description: SiteMinder contains a cross-site scripting vulnerability in the document
  object model. An attacker can execute arbitrary script in the browser of an unsuspecting
  user in the context of the affected site. This can allow the attacker to steal cookie-based
  authentication credentials and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: siteminder-dom-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: clarkvoss; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /siteminderagent/forms/smpwservices.fcc
      - /siteminderagent/forms/smaceauth.fcc
  selection-query-1:
    cs-uri-query:
      - USERNAME=\u003cimg\u0020src\u003dx\u0020onerror\u003d\u0022confirm(document.domain)\u0022\u003e&SMAUTHREASON=7
      - USERNAME=\u003cimg\u0020src\u003dx\u0020onerror\u003d\u0022confirm(document.domain)\u0022\u003e&SMAUTHREASON=7
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
