title: Mega Wordpress Theme - Cross site scripting
id: 80e6bfd5-60b1-4366-95a7-a668675bd705
status: experimental
logsource:
  product: webserver
description: 'WordPress theme with a ''Mega-Theme'' design is vulnerable to a reflected
  XSS attack through the ''?s='' parameter.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wp-mega-theme Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - s=%22%3E%3Cscript%3Ealert(`document.domain`)%3C/script%3E
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
