title: Joomla Solidres 2.13.3 - Cross-Site Scripting
id: 0cb3a9cb-9d31-462f-8a0d-01c879fc1f13
status: experimental
logsource:
  product: webserver
description: 'Joomla extension for Solidres - Online Booking System & Reservation
  Software is vulnerable to XSS in GET parameter ''show''.

  '
reference: 'Generated by converting Nuclei Template. Template ID: joomla-solidres-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /joomla/greenery_hub/index.php/en/hotels/reservations
  selection-query-1:
    cs-uri-query:
      - location=d2tff&task=hub.search&ordering=score&direction=desc&type_id=0&show=db8ck%22onfocus=%22confirm(document.domain)%22autofocus=%22xwu0k
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
