title: WordPress Hide Security Enhancer 1.3.9.2 Local File Inclusion
id: f1d8e759-b43c-494d-ae3a-f91185750ce3
status: experimental
logsource:
  product: webserver
description: WordPress Hide Security Enhancer version 1.3.9.2 or less is susceptible
  to a local file inclusion vulnerability which could allow malicious visitors to
  download any file in the installation.
reference: 'Generated by converting Nuclei Template. Template ID: hide-security-enhancer-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/wp-hide-security-enhancer/router/file-process.php
  selection-query-1:
    cs-uri-query:
      - action=style-clean&file_path=/wp-config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
