title: Netsweeper 4.0.9 - Cross-Site Scripting
id: 4084bdf4-d008-4a40-88c0-d082cac2c393
status: experimental
logsource:
  product: webserver
description: Netsweeper 4.0.9 contains a cross-site scripting vulnerability. An attacker
  can execute arbitrary script in the browser of an unsuspecting user in the context
  of the affected site. This can allow the attacker to steal cookie-based authentication
  credentials and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: netsweeper-rxss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: daffainfo; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /webadmin/reporter/view_server_log.php
  selection-query-1:
    cs-uri-query:
      - server=localhost&act=stats&filename=&offset=1&count=1000&sortorder=&log=%3C%2Fscript%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E&offset=&sortitem=&filter=
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
