title: WordPress Memphis Document Library 3.1.5 - Local File Inclusion
id: ead748b0-b879-42c0-8b65-b76449d8b84f
status: experimental
logsource:
  product: webserver
description: WordPress Memphis Document Library 3.1.5 is vulnerable to local file
  inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: wp-memphis-documents-library-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /mdocs-posts/
      - /
  selection-query-1:
    cs-uri-query:
      - mdocs-img-preview=../../../wp-config.php
      - mdocs-img-preview=../../../wp-config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
