title: Maccmsv10 - Backdoor Remote Code Execution
id: eafc389a-4a43-4318-a9ac-2c4bac93dc27
status: experimental
logsource:
  product: webserver
description: Maccmsv10 contains a backdoor which can be exploited by remote attackers.
  The backdoor is accessible via the '/index.php/bbs/index/download' endpoint and
  the special 'getpwd' parameter value of 'WorldFilledWithLove'. Exploitation of this
  vulnerability will allow remote attackers to execute code.
reference: 'Generated by converting Nuclei Template. Template ID: maccmsv10-backdoor
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: POST
  selection-paths-1:
    cs-uri-stem:
      - /index.php/bbs/index/download
  selection-query-1:
    cs-uri-query:
      - url=/etc/passwd&name=1.txt&local=1
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
