title: Kavita - Local File Inclusion
id: f09d1ab0-8689-4b53-ba56-220da89368a2
status: experimental
logsource:
  product: webserver
description: 'Kavita - Path Traversal is vulnerable to local file inclusion via abusing
  the Path Traversal filename parameter of the /api/image/cover-upload.

  '
reference: 'Generated by converting Nuclei Template. Template ID: kavita-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: arafatansari; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /api/image/cover-upload
  selection-query-1:
    cs-uri-query:
      - filename=../appsettings.json
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
