title: Longjing Technology BEMS API 1.21 - Local File Inclusion
id: fd171dda-ed87-49c0-ab97-722352ac041c
status: experimental
logsource:
  product: webserver
description: Longjing Technology BEMS API 1.21 is vulnerable to local file inclusion.
  Input passed through the fileName parameter through the downloads API endpoint is
  not properly verified before being used to download files. This can be exploited
  to disclose the contents of arbitrary and sensitive files through directory traversal
  attacks.
reference: 'Generated by converting Nuclei Template. Template ID: bems-api-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: gy741; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /api/downloads
  selection-query-1:
    cs-uri-query:
      - fileName=../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
