title: CmsEasy crossall_act - SQL Injection
id: cbd61e1d-ad07-47e6-9869-dec906881e6c
status: experimental
logsource:
  product: webserver
description: 'CmsEasy crossall_act.php SQL Injection Vulnerability. CmsEasy has a
  SQL injection vulnerability. Any SQL command can be executed by encrypting the SQL
  statement in the file service.php.

  '
reference: 'Generated by converting Nuclei Template. Template ID: cmseasy-crossall-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - case=crossall&act=execsql&sql=WY8gzSfZwW9R5YvyK
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
