title: Avaya Aura Utility Services Administration - Cross-Site Scripting
id: acacbaba-3d3a-406a-8c8c-533b2c25c2d2
status: experimental
logsource:
  product: webserver
description: Avaya Aura Utility Services Administration contains a cross-site scripting
  vulnerability. An attacker can inject arbitrary script in the browser of an unsuspecting
  user in the context of the affected site. This can allow the attacker to steal cookie-based
  authentication credentials and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: avaya-aura-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /admin/public/login.jsp
      - /acs/..;/admin/public/login.jsp
  selection-query-1:
    cs-uri-query:
      - error=%3Cscript%3Ealert(document.domain)%3C/script%3e
      - error=%3Cscript%3Ealert(document.domain)%3C/script%3e
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
