title: Ecology 8 - SQL Injection
id: 7ac398e4-01e3-408e-a4cf-65611b424dec
status: experimental
logsource:
  product: webserver
description: Ecology 8 contains a SQL injection vulnerability via a GET request. An
  attacker can possibly obtain sensitive information from a database, modify data,
  and execute unauthorized administrative operations in the context of the affected
  site.
reference: 'Generated by converting Nuclei Template. Template ID: ecology-v8-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /js/hrm/getdata.jsp
  selection-query-1:
    cs-uri-query:
      - cmd=getSelectAllId&sql=select+547653*865674+as+id
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
