title: WordPress NativeChurch Theme - Local File Inclusion
id: 55e25fcb-13fc-4e56-8dfe-62887df9954c
status: experimental
logsource:
  product: webserver
description: 'WordPress NativeChurch Theme is vulnerable to local file inclusion in
  the download.php file.

  '
reference: 'Generated by converting Nuclei Template. Template ID: nativechurch-wp-theme-lfd
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/themes/NativeChurch/download/download.php
  selection-query-1:
    cs-uri-query:
      - file=../../../../wp-config.php
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
