title: Seeyon WooYun - Local File Inclusion
id: 266547d0-f540-4365-982c-fd6441c85933
status: experimental
logsource:
  product: webserver
description: Seeyon WooYun allows remote attackers to include the content of locally
  stored content and disclose it back to the attacker via local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: wooyun-2015-148227
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /NCFindWeb
  selection-query-1:
    cs-uri-query:
      - service=IPreAlertConfigService&filename=WEB-INF/web.xml
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
