title: Tongda OA V2017 Video File - Arbitrary File Read
id: d4dd399a-14f9-49fa-9367-78b57f71779e
status: experimental
logsource:
  product: webserver
description: 'There is an arbitrary file reading vulnerability in Extreme OA video_file.php.
  An attacker can obtain sensitive files on the server through the vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: tongda-video-file-read
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /general/mytable/intel_view/video_file.php
  selection-query-1:
    cs-uri-query:
      - MEDIA_DIR=../../../inc/&MEDIA_NAME=oa_config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
