title: HJTcloud - Local File Inclusion
id: 2863c65c-e276-46df-822b-4193de60163c
status: experimental
logsource:
  product: webserver
description: HJTcloud is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: hjtcloud-rest-arbitrary-file-read
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /him/api/rest/V1.0/system/log/list
  selection-query-1:
    cs-uri-query:
      - filePath=../
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
