title: DedeCMS 5.7 - Cross-Site Scripting
id: db2e1c25-363b-407c-afbe-e24d8cd7ce8a
status: experimental
logsource:
  product: webserver
description: 'DeDeCMS 5.7 contains a cross-site scripting vulnerability in the ''/include/dialog/config.php''
  file. An attacker can execute arbitrary script in the browser of an unsuspecting
  user in the context of the affected site.

  '
reference: 'Generated by converting Nuclei Template. Template ID: dedecms-config-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /include/dialog/config.php
  selection-query-1:
    cs-uri-query:
      - adminDirHand=%3C%2Fscript%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
