title: WebUI 1.5b6 - Remote Code Execution
id: 2a3174bc-cebd-4204-ac4c-8844f156f48f
status: experimental
logsource:
  product: webserver
description: WebUI 1.5b6 is vulnerable to remote code execution because the 'mainfile.php'
  endpoint allows remote attackersto execute arbitrary code via the 'Logon' parameter.
reference: 'Generated by converting Nuclei Template. Template ID: webui-rce Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /mainfile.php
  selection-query-1:
    cs-uri-query:
      - username=test&password=testpoc&_login=1&Logon=%27%3Becho%20md5(TestPoc)%3B%27
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
