title: WordPress Amministrazione Aperta 3.7.3 - Local File Inclusion
id: 418ea955-81e8-4340-a060-3d69ea2bdfa3
status: experimental
logsource:
  product: webserver
description: WordPress Amministrazione Aperta 3.7.3 is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: amministrazione-aperta-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: daffainfo,Splint3r7; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/amministrazione-aperta/wpgov/dispatcher.php
  selection-query-1:
    cs-uri-query:
      - open=../../../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
