title: DSS Download - Local File Inclusion
id: 9e6899be-b1b1-477a-883f-c0db46add5e7
status: experimental
logsource:
  product: webserver
description: DSS Download is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: dss-download-fileread
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /portal/attachment_downloadByUrlAtt.action
  selection-query-1:
    cs-uri-query:
      - filePath=file:///etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
