title: Sangfor Application download.php - Arbitary File Read
id: 9a52fe4b-7547-44aa-a542-0d101a39d4b2
status: experimental
logsource:
  product: webserver
description: 'There is an arbitrary file reading vulnerability in the Sangfor Application
  download.php.

  '
reference: 'Generated by converting Nuclei Template. Template ID: sangfor-download-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /report/download.php
  selection-query-1:
    cs-uri-query:
      - pdf=../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
