title: FeiFeiCms - Local File Inclusion
id: f4fa84c4-3c37-44bb-bef7-45b14bd50416
status: experimental
logsource:
  product: webserver
description: FeiFeiCms is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: feifeicms-lfr Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - s=Admin-Data-down&id=../../Conf/config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
