title: ThinkPHP 2/3 - Remote Code Execution
id: 6788b846-ccdd-48c3-b4c7-c21a3e9f6830
status: experimental
logsource:
  product: webserver
description: ThinkPHP 2.x and 3.0 in Lite mode are susceptible to remote code execution
  via the s parameter. An attacker can execute malware, obtain sensitive information,
  modify data, and/or gain full control over a compromised system without entering
  necessary credentials.
reference: 'Generated by converting Nuclei Template. Template ID: thinkphp-2-rce Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dr_set; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - s=/index/index/name/$%7B@phpinfo()%7D
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
