title: WordPress PHPFreeChat 0.2.8 - Cross-Site Scripting
id: 43c4d2e3-e3ff-423d-83a0-61e9b244f15c
status: experimental
logsource:
  product: webserver
description: WordPress PHPFreeChat 0.2.8 plugin contains a cross-site scripting vulnerability
  via the url parameter. An attacker can execute arbitrary script in the browser of
  an unsuspecting user in the context of the affected site. This can allow the attacker
  to steal cookie-based authentication credentials and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: wp-phpfreechat-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: daffainfo; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/phpfreechat/lib/csstidy-1.2/css_optimiser.php
  selection-query-1:
    cs-uri-query:
      - url=%3C%2Fscript%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
