title: Accent Microcomputers LFI
id: 3da30283-3e24-4ca8-94bc-f865a6d31c06
status: experimental
logsource:
  product: webserver
description: A local file inclusion vulnerability in Accent Microcomputers offerings
  could allow remote attackers to retrieve password files.
reference: 'Generated by converting Nuclei Template. Template ID: accent-microcomputers-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - id=50&file=../../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
