title: Ecology Syncuserinfo - SQL Injection
id: 05838d54-7325-4bb3-8fd3-6a1c6964d294
status: experimental
logsource:
  product: webserver
description: Ecology Syncuserinfo contains a SQL injection vulnerability via a GET
  request. An attacker can possibly obtain sensitive information from a database,
  modify data, and execute unauthorized administrative operations in the context of
  the affected site.
reference: 'Generated by converting Nuclei Template. Template ID: ecology-syncuserinfo-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /mobile/plugin/SyncUserInfo.jsp
  selection-query-1:
    cs-uri-query:
      - userIdentifiers=-1)union(select(3),null,null,null,null,null,str(98989*44313),null
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
