title: NUUO NVRmini 2 3.0.8 - Local File Inclusion
id: a89429cd-d7a3-4eb7-ad5c-1d13d6827b38
status: experimental
logsource:
  product: webserver
description: NUUO NVRmini 2 3.0.8 is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: nuuo-file-inclusion
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /css_parser.php
  selection-query-1:
    cs-uri-query:
      - css=css_parser.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
