title: Kingsoft VGM Antivirus - Arbitrary File Read
id: 8ebc30c0-5bfc-47b9-ada1-e03f70b9e546
status: experimental
logsource:
  product: webserver
description: 'There is an arbitrary file reading vulnerability in Kingsoft Antivirus.
  An attacker can obtain any file on the server through the vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: kingsoft-vgm-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: abbas.heybati; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /downFile.php
  selection-query-1:
    cs-uri-query:
      - filename=../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
