title: AeroCMS 0.0.1 - SQL Injection
id: 850d335e-75af-4a56-85ab-876ade61a684
status: experimental
logsource:
  product: webserver
description: 'AeroCMS 0.0.1 contains a SQL injection vulnerability via the author
  parameter. An attacker can possibly obtain sensitive information, modify data, and/or
  execute unauthorized administrative operations in the context of the affected site.

  '
reference: 'Generated by converting Nuclei Template. Template ID: aerocms-sqli Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: shivampand3y; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /author_posts.php
      - /cms/author_posts.php
  selection-query-1:
    cs-uri-query:
      - author=admin%27%20UNION%20ALL%20SELECT%20NULL,NULL,NULL,NULL,NULL,NULL,NULL,CONCAT(md5({{num}}),1,1),NULL,NULL,NULL,NULL--%20-&p_id=1
      - author=admin%27%20UNION%20ALL%20SELECT%20NULL,NULL,NULL,NULL,NULL,NULL,NULL,CONCAT(md5({{num}}),1,1),NULL,NULL,NULL,NULL--%20-&p_id=1
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
