title: Sangfor BA - Remote Code Execution
id: d8b33745-b314-455c-83e6-02ce12d83452
status: experimental
logsource:
  product: webserver
description: 'Sangfor products allow remote unauthenticated users to cause the product
  to execute arbitrary commands.

  '
reference: 'Generated by converting Nuclei Template. Template ID: sangfor-ba-rce Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /tool/log/c.php
  selection-query-1:
    cs-uri-query:
      - strip_slashes=md5&host={{randstr}}
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
