title: Joomla! Component Easy Shop 1.2.3 - Local File Inclusion
id: a7257058-0530-4a25-a9e2-05bf3d9dede3
status: experimental
logsource:
  product: webserver
description: 'The Joomla! component Easy Shop version 1.2.3 is vulnerable to Local
  File Inclusion (LFI) attacks.

  '
reference: 'Generated by converting Nuclei Template. Template ID: joomla-easyshop-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - option=com_easyshop&task=ajax.loadImage&file=Li4vLi4vY29uZmlndXJhdGlvbi5waHA=
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
