title: SeaCMS 8.7 - SQL Injection
id: 701054a6-a8d8-48d7-9edf-e7584b256970
status: experimental
logsource:
  product: webserver
description: SeaCMS 8.7 contains a SQL injection vulnerability. An attacker can possibly
  obtain sensitive information from a database, modify data, and execute unauthorized
  administrative operations in the context of the affected site.
reference: 'Generated by converting Nuclei Template. Template ID: seacms-sqli Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /comment/api/index.php
  selection-query-1:
    cs-uri-query:
      - gid=1&page=2&rlist[]=@`%27`,%20extractvalue(1,%20concat_ws(0x20,%200x5c,(select%20md5({{num}})))),@`%27`
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
