title: Ruijie RG-EG - Remote Code Execution
id: 04717fe0-3a84-46b4-a874-c2f501ef03b3
status: experimental
logsource:
  product: webserver
description: 'Ruijie RG-EG easy gateway WEB management system front-end RCE has a
  command execution vulnerability. An attacker without identity authentication can
  execute arbitrary commands to control server permissions.

  '
reference: 'Generated by converting Nuclei Template. Template ID: ruijie-rg-eg-web-mis-rce
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /update.php
  selection-query-1:
    cs-uri-query:
      - jungle=id
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
