title: SiteCore XML Control Script Insertion
id: 56dfded5-935d-4932-ac99-201def9b81ae
status: experimental
logsource:
  product: webserver
description: "Sitecores \u201Cspecial way\u201D of displaying XML Controls directly\
  \ allows for a Cross Site Scripting Attack \u2013 more can be achieved with these\
  \ XML Controls\n"
reference: 'Generated by converting Nuclei Template. Template ID: sitecore-xml-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - xmlcontrol=body%20onload=alert(document.domain)
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
