title: Discourse - Cross-Site Scripting
id: d32c9b49-beb4-44cf-9276-35794c2d162b
status: experimental
logsource:
  product: webserver
description: Discourse contains a cross-site scripting vulnerability. An attacker
  can execute arbitrary script and thus steal cookie-based authentication credentials
  and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: discourse-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: madrobot; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /email/unsubscribed
  selection-query-1:
    cs-uri-query:
      - email=test@gmail.com%27\%22%3E%3Csvg/onload=alert(/xss/)%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
