title: UEditor - Server Side Request Forgery
id: 948aa11e-82f8-4521-9833-9429a16dfc08
status: experimental
logsource:
  product: webserver
description: UEditor contains an Server Side Request Forgery vulnerability.
reference: 'Generated by converting Nuclei Template. Template ID: ueditor-ssrf Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pwnhxl; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /ueditor/php/controller.php
      - /ueditor/jsp/controller.jsp
  selection-query-1:
    cs-uri-query:
      - action=catchimage&source[]=http://127.0.0.1:{{rand_text_numeric(6)}}/
      - action=catchimage&source[]=http://127.0.0.1:{{rand_text_numeric(6)}}/
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
