title: Joomla JVTwitter - Cross-Site Scripting
id: 32816c9d-ba17-4cd6-8015-a247de4c1804
status: experimental
logsource:
  product: webserver
description: 'The attacker can send to victim a link containing a malicious URL in
  an email or instant message can perform a wide variety of actions, such as stealing
  the victim''s session token or login credentials.

  '
reference: 'Generated by converting Nuclei Template. Template ID: joomla-jvtwitter-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /modules/mod_jvtwitter/jvtwitter.php
      - /modules/mod_jvtwitter/jvtwitter.php
  selection-query-1:
    cs-uri-query:
      - id=%22%3E%3Cimg%20src=x%20onerror=prompt(document.domain);%3E
      - id=
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
