title: Reddit Top RSS - Cross-Site Scripting
id: 07f8221c-b02a-456a-ae70-6a1285a9bc4b
status: experimental
logsource:
  product: webserver
description: 'Reddit Top RSS contains a cross-site scripting vulnerability via the
  /?subreddit=news&score= parameter.

  '
reference: 'Generated by converting Nuclei Template. Template ID: reddittop-rss-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: arafatansari; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - subreddit=news&score=2134%22%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
