title: FineCMS 5.0.10 - SQL Injection
id: 2d16cb53-7aba-4fbe-aa6a-231161937391
status: experimental
logsource:
  product: webserver
description: 'FineCMS 5.0.10 contains a SQL injection vulnerability. An attacker can
  possibly obtain sensitive information from a database, modify data, and execute
  unauthorized administrative operations in the context of the affected site.

  '
reference: 'Generated by converting Nuclei Template. Template ID: finecms-sqli Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - c=api&m=data2&auth=582f27d140497a9d8f048ca085b111df&param=action=sql%20sql=%27select%20md5({{num}})%27
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
