title: ZendFramework 1.12.2 - Cross-Site Scripting
id: 1898f6ac-ed6e-4a82-9e6b-37a1dfd152f3
status: experimental
logsource:
  product: webserver
description: 'ZendFramework of versions <=1.12.2 contain a cross-site scripting vulnerability
  via an arbitrarily supplied parameter.

  '
reference: 'Generated by converting Nuclei Template. Template ID: zend-v1-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: c3l3si4n; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /vendor/diablomedia/zendframework1-http/tests/Zend/Http/Client/_files/testRedirections.php
      - /tests/Zend/Http/Client/_files/testRedirections.php
  selection-query-1:
    cs-uri-query:
      - redirection=3&param=<img/src=x%20onerror=alert(1)>
      - redirection=3&param=<img/src=x%20onerror=alert(document.domain)>
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
