title: Tongda OA v11.9 getadata - Remote Code Execution
id: 74a42f54-65bf-4280-af41-45bd65852803
status: experimental
logsource:
  product: webserver
description: 'There is an arbitrary command execution vulnerability in the getdata
  interface of Tongda OA v11.9. An attacker can execute arbitrary commands on the
  server to control server permissions through the vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: tongda-getdata-rce
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /general/appbuilder/web/portal/gateway/getdata
  selection-query-1:
    cs-uri-query:
      - activeTab=%E5%27%19,1%3D%3Eeval(base64_decode(%22{{base64(payload)}}%22)))%3B/*&id=19&module=Carouselimage
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
