title: Hongfan OA ioFileExport.aspx - Arbitrary File Read
id: 6b7896e6-6e13-48cb-86d4-e8cd2f35b999
status: experimental
logsource:
  product: webserver
description: 'Arbitrary File Read vulnerability in the Hongfan OA ioFileExport.aspx
  file, through which an attacker can obtain sensitive server information

  '
reference: 'Generated by converting Nuclei Template. Template ID: hongfan-ioffice-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /ioffice/prg/set/iocom/ioFileExport.aspx
  selection-query-1:
    cs-uri-query:
      - url=/ioffice/web.config&filename={{filename}}.txt&ContentType=application/octet-stream
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
