title: GZ Forum Script 1.8 - Cross-Site Scripting
id: 4948c4b0-4e71-413d-8180-0646956f376c
status: experimental
logsource:
  product: webserver
description: 'Cross-site scripting (XSS) is an attack in which an attacker injects
  malicious executable scripts into the code of a trusted application or website.
  Attackers often initiate an XSS attack by sending a malicious link to a user and
  enticing the user to click it.

  '
reference: 'Generated by converting Nuclei Template. Template ID: gz-forum-script-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /preview.php
  selection-query-1:
    cs-uri-query:
      - controller=Load&action=index&catid=moztj%22%3E%3Cscript%3Ealert(document.domain)%3C%2fscript%3Ems3ea&down_up=a
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
