title: ERP-NC - Local File Inclusion
id: 3759f4ef-feb3-40e8-bd50-ca19c6d0ec5a
status: experimental
logsource:
  product: webserver
description: ERP-NC is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: erp-nc-directory-traversal
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /NCFindWeb
  selection-query-1:
    cs-uri-query:
      - service=IPreAlertConfigService&filename=
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
