title: DedeCMS - Open Redirect
id: 0f3536d5-67b7-4051-a63b-89c96949abf1
status: experimental
logsource:
  product: webserver
description: DedeCMS contains an open redirect vulnerability. An attacker can redirect
  a user to a malicious site and possibly obtain sensitive information, modify data,
  and/or execute unauthorized operations.
reference: 'Generated by converting Nuclei Template. Template ID: dedecms-openredirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /plus/download.php
  selection-query-1:
    cs-uri-query:
      - open=1&link=aHR0cHM6Ly9pbnRlcmFjdC5zaA==
  selection-status-code-1:
    sc-status: 302
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
