title: BrightSign Digital Signage Diagnostic Web Server 8.2.26 Unauthenticated - SSRF
id: 13ae578f-00f5-4ada-bc9b-a78fbc04c3b3
status: experimental
logsource:
  product: webserver
description: Unauthenticated Server-Side Request Forgery (SSRF) vulnerability exists
  in the BrightSign digital signage media player affecting the Diagnostic Web Server
  (DWS). The application parses user supplied data in the 'url' GET parameter to construct
  a diagnostics request to the Download Speed Test service.
reference: 'Generated by converting Nuclei Template. Template ID: brightsign-dsdws-ssrf
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /speedtest
  selection-query-1:
    cs-uri-query:
      - url={{interactsh-url}}
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
