title: Joomla JLex Review 6.0.1 - Cross-Site Scripting
id: b3272dab-2ff9-40e4-a2b2-949b5f30115c
status: experimental
logsource:
  product: webserver
description: 'The attacker can send to victim a link containing a malicious URL in
  an email or instant message can perform a wide variety of actions, such as stealing
  the victim''s session token or login credentials.

  '
reference: 'Generated by converting Nuclei Template. Template ID: joomla-jlex-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - review_id=1&itwed%22onmouseover=%22confirm(document.domain)%22style=%22position:absolute%3bwidth:100%25%3bheight:100%25%3btop:0%3bleft:0%3b%22b7yzn=1
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
