title: Jira Unauthenticated Dashboards
id: 02c97a9d-a466-486f-9d41-75ada45ccd6d
status: experimental
logsource:
  product: webserver
description: 'Converted from a Nuclei template; ID: jira-unauthenticated-dashboards'
reference: 'Generated by converting Nuclei Template. Template ID: jira-unauthenticated-dashboards
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: TechbrunchFR; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /rest/api/2/dashboard
  selection-query-1:
    cs-uri-query:
      - maxResults=100
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
