title: Open Redirect - Detection
id: 17064022-675c-46b3-a801-c714b12175cc
status: experimental
logsource:
  product: webserver
description: An open redirect vulnerability was detected. An attacker can redirect
  a user to a malicious site and possibly obtain sensitive information, modify data,
  and/or execute unauthorized operations.
reference: 'Generated by converting Nuclei Template. Template ID: open-redirect-generic
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: afaq,melbadry9,Elmahdi,pxmme1337,Regala_,andirrahmani1,geeknik;
  Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - '{{RootURL}}/{{redirect}}'
  selection-status-code-1:
    sc-status: 301
  condition: selection-method-1 and selection-paths-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
