title: Shiziyu CMS Api Controller - SQL Injection
id: 8b7dd512-95c4-404b-8dd8-277c50209d73
status: experimental
logsource:
  product: webserver
description: 'Shiziyu CMS ApiController.class.php parameter filtering is not rigorous,
  resulting in SQL injection vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: shiziyu-cms-apicontroller-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - s=api/goods_detail&goods_id=1%20and%20updatexml(1,concat(0x7e,md5({{num}}),0x7e),1)
  selection-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
