title: Dotnet CMS -  SQL Injection
id: d53406df-85c0-4089-af0b-750449277455
status: experimental
logsource:
  product: webserver
description: Dotnet CMS contains a SQL injection vulnerability. An attacker can possibly
  obtain sensitive information from a database, modify data, and execute unauthorized
  administrative operations in the context of the affected site.
reference: 'Generated by converting Nuclei Template. Template ID: dotnetcms-sqli Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /user/City_ajax.aspx
  selection-query-1:
    cs-uri-query:
      - CityId=33'union%20select%20sys.fn_sqlvarbasetostr(HashBytes('MD5','{{randstr}}')),2--
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
