title: TamronOS IPTV - Arbitrary User Creation
id: fd4cbdd1-6c77-4883-8c00-fed50ab0273d
status: experimental
logsource:
  product: webserver
description: Unathenticated attackers can create multiple users in TamronOS IPTV.
reference: 'Generated by converting Nuclei Template. Template ID: tamronos-user-creation
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pussycat0x; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /api/manager/submit
  selection-query-1:
    cs-uri-query:
      - group=1&username={{username}}&password={{password}}
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
