title: BSPHP - Information Disclosure
id: 590bae5b-69dd-4106-9c85-ad75f6097d2d
status: experimental
logsource:
  product: webserver
description: Information disclosure in BSPHP Pro causing user and unauth IP disclosure.
reference: 'Generated by converting Nuclei Template. Template ID: bsphp-info Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /admin/index.php
  selection-query-1:
    cs-uri-query:
      - m=admin&c=log&a=table_json&json=get&soso_ok=1&t=user_login_log&page=1&limit=10&bsphptime=1600407394176&soso_id=1&soso=&DESC=0
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
