title: NatShell - Local File Inclusion
id: 18483bf0-3eb7-4136-b42c-bfd54356c153
status: experimental
logsource:
  product: webserver
description: NatShell is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: natshell-path-traversal
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /download.php
  selection-query-1:
    cs-uri-query:
      - file=../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
