title: SHOOWBIZ - Cross Site Scripting
id: 72eccbba-d739-44f9-9196-b5affa3e4373
status: experimental
logsource:
  product: webserver
description: 'Cross-Site Scripting, is a type of security vulnerability commonly found
  in web applications. It occurs when an attacker injects malicious scripts (typically
  written in JavaScript) into web pages viewed by other users.

  '
reference: 'Generated by converting Nuclei Template. Template ID: shoowbiz-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /search.php
  selection-query-1:
    cs-uri-query:
      - q=%3CScRipT%3Ealert(document.domain);%3C/ScRipT%3E
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
