title: Chamilo LMS 1.11.14 Cross-Site Scripting
id: 082605f5-8c0a-4ad6-9f55-740cd09ea684
status: experimental
logsource:
  product: webserver
description: Chamilo LMS 1.11.14 is vulnerable to cross-site scripting.
reference: 'Generated by converting Nuclei Template. Template ID: chamilo-lms-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: geeknik; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /main/calendar/agenda_list.php
  selection-query-1:
    cs-uri-query:
      - type=xss"+onmouseover=alert(document.domain)+"
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
