title: IDoc View /html/2word - Arbitrary File Upload
id: 1c9873c2-c313-45e8-8033-73fd6848fcd5
status: experimental
logsource:
  product: webserver
description: 'Converted from a Nuclei template; ID: idocview-2word-fileupload'
reference: 'Generated by converting Nuclei Template. Template ID: idocview-2word-fileupload
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /html/2word
  selection-query-1:
    cs-uri-query:
      - url={{file}}
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
