title: Webbdesign SL-Studio - Local File Inclusion
id: 3f44bb67-d33a-4797-a2a5-29b7612b30f8
status: experimental
logsource:
  product: webserver
description: Webbdesign SL-Studio is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: sl-studio-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - page=../../../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
