title: kkFileView 4.0.0 - Server-Side Request Forgery
id: 85152e79-9b4f-4fb7-a3d1-53f202789bf8
status: experimental
logsource:
  product: webserver
description: 'kkFileView 4.0.0 is susceptible to server-side request forgery

  '
reference: 'Generated by converting Nuclei Template. Template ID: kkfileview-ssrf
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: Arm!tage; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /onlinePreview
  selection-query-1:
    cs-uri-query:
      - url={{base64('http://oast.fun/robots.txt')}}
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
