title: WordPress WPtouch 3.7.5 - Open Redirect
id: e85c86c9-70a1-43ba-9975-b8b59aa61353
status: experimental
logsource:
  product: webserver
description: 'WordPress WPtouch 3.7.5 is affected by an Open Redirect issue.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wp-touch-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - wptouch_switch=desktop&redirect=http://interact.sh
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
