title: WordPress FlagEm - Cross-Site Scripting
id: 1adf5245-7090-488b-a25c-4fc55ecd6d8b
status: experimental
logsource:
  product: webserver
description: WordPress FlagEm plugin contains a cross-site scripting vulnerability.
  An attacker can execute arbitrary script in the browser of an unsuspecting user
  in the context of the affected site. This can allow the attacker to steal cookie-based
  authentication credentials and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: wp-flagem-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: daffainfo; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/FlagEm/flagit.php
  selection-query-1:
    cs-uri-query:
      - cID=%22%3E%3C%2Fscript%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
