title: Oliver 5 Library Server <8.00.008.053 - Local File Inclusion
id: f9ffab3a-2bfe-4e86-9b27-e4a29da43e62
status: experimental
logsource:
  product: webserver
description: Oliver 5 Library Server versions prior to 8.00.008.053 are vulnerable
  to local file inclusion via the FileServlet function.
reference: 'Generated by converting Nuclei Template. Template ID: oliver-library-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: gy741; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /oliver/FileServlet
  selection-query-1:
    cs-uri-query:
      - source=serverFile&fileName=c:/windows/win.ini
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
