title: FineReport 8.0 - Local File Inclusion
id: 6d101896-c065-4e17-8d44-4ac16e4197fa
status: experimental
logsource:
  product: webserver
description: FIneReport  8.0 is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: finereport-path-traversal
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /WebReport/ReportServer
      - /report/ReportServer
  selection-query-1:
    cs-uri-query:
      - op=chart&cmd=get_geo_json&resourcepath=privilege.xml
      - op=chart&cmd=get_geo_json&resourcepath=privilege.xml
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
