title: UniSharp Laravel File Manager 2.0.0 - Arbitrary File Read
id: 293675ca-a2e4-4d14-a674-d640c8e65258
status: experimental
logsource:
  product: webserver
description: UniSharp Larevel File Manager 2.0.0 is vulnerable to arbitrary file read.
reference: 'Generated by converting Nuclei Template. Template ID: laravel-filemanager-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: hackerarpan; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /laravel-filemanager/download
  selection-query-1:
    cs-uri-query:
      - working_dir=%2F..%2F..%2F..%2F..%2F..%2F..%2F..%2F..%2F..%2F..%2Fetc%2F&type=&file=passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
