title: Hanming Video Conferencing - Local File Inclusion
id: 2ab9cb91-2c1f-4425-a6ce-e2214608f799
status: experimental
logsource:
  product: webserver
description: Hanming Video Conferencing is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: hanming-lfr Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /register/toDownload.do
      - /register/toDownload.do
  selection-query-1:
    cs-uri-query:
      - fileName=../../../../../../../../../../../../../../windows/win.ini
      - fileName=../../../../../../../../../../../../../../etc/passwd
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
