title: Umbraco 8.14.1 - baseUrl Server-Side Request Forgery (SSRF)
id: 3759545e-81f2-4448-aa04-6b693eafb48f
status: experimental
logsource:
  product: webserver
description: Umbraco 8.1.4.1 allows attackers to use the baseUrl parameter to several
  programs to perform a server-side request forgery (SSRF) attack.
reference: 'Generated by converting Nuclei Template. Template ID: umbraco-base-ssrf
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /umbraco/BackOffice/Api/Help/GetContextHelpForPage
      - /umbraco/backoffice/UmbracoApi/Dashboard/GetRemoteDashboardContent
      - /umbraco/backoffice/UmbracoApi/Dashboard/GetRemoteDashboardCss
  selection-query-1:
    cs-uri-query:
      - section=content&tree=undefined&baseUrl=http://{{interactsh-url}}
      - section=TryToAvoidGetCacheItem111&baseUrl=http://{{interactsh-url}}/
      - section=AvoidGetCacheItem&baseUrl=http://{{interactsh-url}}/
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
