title: 74cms Sql Injection
id: 3191c3be-e480-4e35-ad36-fe96f56802af
status: experimental
logsource:
  product: webserver
description: A SQL injection vulnerability exists in 74cms 5.0.1 AjaxPersonalController.class.php.
reference: 'Generated by converting Nuclei Template. Template ID: 74cms-sqli Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - m=&c=AjaxPersonal&a=company_focus&company_id[0]=match&company_id[1][0]=test")
        and extractvalue(1,concat(0x7e,md5({{num}}))) -- a
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
