title: Wanhu OA download_old.jsp - Arbitrary File Read
id: 42c70b6a-872f-491b-ab3b-b35b8ba59f73
status: experimental
logsource:
  product: webserver
description: 'There is an arbitrary file download vulnerability in the Wanhu OA download_old.jsp
  file. An attacker can download any file on the server through the vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wanhu-download-old-file-read
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /defaultroot/download_old.jsp
  selection-query-1:
    cs-uri-query:
      - path=..&name=x&FileName=WEB-INF/web.xml
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
