title: DedeCmsV5.6 Carbuyaction Fileinclude
id: d15ae420-4bb6-4958-a039-71f0cc2896d4
status: experimental
logsource:
  product: webserver
description: A vulnerability in DedeCMS's 'carbuyaction.php' endpoint allows remote
  attackers to return the content of locally stored files via a vulnerability in the
  'code' parameter.
reference: 'Generated by converting Nuclei Template. Template ID: dedecms-carbuyaction-fileinclude
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /plus/carbuyaction.php
  selection-query-1:
    cs-uri-query:
      - dopost=return&code=../../
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
