title: Thinkific - Open Redirect
id: 81923ec9-1f69-418b-ba9b-06ef8907de3d
status: experimental
logsource:
  product: webserver
description: Thinkific contains an open redirect vulnerability via the http://interact.sh
  URL. An attacker can redirect a user to a malicious site and possibly obtain sensitive
  information, modify data, and/or execute unauthorized operations.
reference: 'Generated by converting Nuclei Template. Template ID: thinkific-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: Gal Nagli; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /api/sso/v2/sso/jwt
  selection-query-1:
    cs-uri-query:
      - error_url=http://interact.sh
  selection-status-code-1:
    sc-status: 302
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
