title: Alibaba Anyproxy fetchBody File - Path Traversal
id: 3b5a330e-1c37-4db4-a645-462b25e29226
status: experimental
logsource:
  product: webserver
description: Alibaba Anyproxy is vulnerable to Path Traversal.
reference: 'Generated by converting Nuclei Template. Template ID: alibaba-anyproxy-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /fetchBody
  selection-query-1:
    cs-uri-query:
      - id=1/../../../../../../../../etc/passwd
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
