title: Jira Unauthenticated Access to screens
id: 2566121f-11b2-49b8-a23e-3d5c1c4c0e74
status: experimental
logsource:
  product: webserver
description: 'Converted from a Nuclei template; ID: jira-unauthenticated-screens'
reference: 'Generated by converting Nuclei Template. Template ID: jira-unauthenticated-screens
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: TESS; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /rest/api/2/screens
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
