title: SquirrelMail 1.2.11 - Local File Inclusion
id: f5f0e7f3-9d4a-4fa9-ae64-de8282fbe449
status: experimental
logsource:
  product: webserver
description: SquirrelMail 1.2.11 is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: squirrelmail-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /src/read_body.php
      - /src/download.php
  selection-query-1:
    cs-uri-query:
      - mailbox=/etc/passwd&passed_id=1&
      - absolute_dl=true&passed_id=1&passed_ent_id=1&mailbox=/etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
