title: WordPress Manage Calameo Publications 1.1.0 - Cross-Site Scripting
id: 379f3022-3d4b-4d6c-ae60-44e11a48c17e
status: experimental
logsource:
  product: webserver
description: 'WordPress Manage Calameo Publications 1.1.0 is vulnerable to reflected
  cross-site scripting via  thickbox_content.php and the attachment_id parameter.

  '
reference: 'Generated by converting Nuclei Template. Template ID: calameo-publications-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/athlon-manage-calameo-publications/thickbox_content.php
  selection-query-1:
    cs-uri-query:
      - attachment_id=id%22%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E%26
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
