title: Wordpress RDF User Enumeration
id: 9aa7a039-788d-409b-8ee1-1caeb6ba82dd
status: experimental
logsource:
  product: webserver
description: Leaked Wordpress RDF leads to User Emumeration.
reference: 'Generated by converting Nuclei Template. Template ID: wordpress-rdf-user-enum
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3dg33k; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /feed/rdf
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
