title: Splash Render - SSRF
id: 7843e00c-c734-470d-9c91-6e78d32ad788
status: experimental
logsource:
  product: webserver
description: Splash Render is vulnerable to Server-Side Request Forgery (SSRF) Vulnerability.
reference: 'Generated by converting Nuclei Template. Template ID: splash-render-ssrf
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pwnhxl; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /render.html
  selection-query-1:
    cs-uri-query:
      - url=https://oast.live
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
