title: WordPress user registration enabled
id: a87fefcd-757c-4798-9a33-825a4562a52f
status: experimental
logsource:
  product: webserver
description: 'Converted from a Nuclei template; ID: wp-enabled-registration'
reference: 'Generated by converting Nuclei Template. Template ID: wp-enabled-registration
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: Ratnadip Gajbhiye; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-login.php
  selection-query-1:
    cs-uri-query:
      - action=register
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
