title: MetInfo <=6.1.0 - Local File Inclusion
id: 12f8fac2-2d09-4aed-947d-ed24607e6d99
status: experimental
logsource:
  product: webserver
description: MetInfo 6.0.0 through 6.1.0 is vulnerable to local file inclusion and
  allows remote unauthenticated attackers access to locally stored files and their
  content.
reference: 'Generated by converting Nuclei Template. Template ID: metinfo-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /include/thumb.php
      - /include/thumb.php
      - /include/thumb.php
  selection-query-1:
    cs-uri-query:
      - dir=http/.....///.....///config/config_db.php
      - dir=.....///http/.....///config/config_db.php
      - dir=http\\..\\..\\config\\config_db.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
