title: Karel IP Phone IP1211 Web Management Panel - Local File Inclusion
id: fcc9a9e9-12b3-406c-807d-7592ed236af9
status: experimental
logsource:
  product: webserver
description: Karel IP Phone IP1211 Web Management Panel is vulnerable to local file
  inclusion and can allow remote attackers to access arbitrary files stored on the
  remote device via the 'cgiServer.exx' endpoint and the 'page' parameter.
reference: 'Generated by converting Nuclei Template. Template ID: karel-ip-phone-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /cgi-bin/cgiServer.exx
  selection-query-1:
    cs-uri-query:
      - page=../../../../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
