title: "nginxWebUI \u2264 3.5.0 runCmd - Remote Command Execution"
id: c351f1bf-3d37-44c0-b2bf-5b691ae4fc55
status: experimental
logsource:
  product: webserver
description: "nginxWebUI\u2019s runCmd feature and is caused by incomplete validation\
  \ of user input. Attackers can exploit the vulnerability by crafting malicious data\
  \ to execute arbitrary commands on a vulnerable server without authorization.\n"
reference: 'Generated by converting Nuclei Template. Template ID: nginxwebui-runcmd-rce
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /AdminPage/conf/runCmd
  selection-query-1:
    cs-uri-query:
      - cmd=id
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
