title: Joomla `departments` - SQL Injection
id: 377a7bb6-f9e4-4740-b63f-cc79f01ea649
status: experimental
logsource:
  product: webserver
description: 'Joomla! `com_departments` parameter contains a SQL injection vulnerability.
  An attacker can possibly obtain sensitive information from a database, modify data,
  and execute unauthorized administrative operations in the context of the affected
  site.

  '
reference: 'Generated by converting Nuclei Template. Template ID: joomla-department-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - option=com_departments&id=-1%20UNION%20SELECT%201,md5({{num}}),3,4,5,6,7,8--
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
