title: Global Domains International - Local File Inclusion
id: 5815b259-4ae6-4fbe-8f69-1ad10c5ed66f
status: experimental
logsource:
  product: webserver
description: Global Domains International is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: global-domains-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /kvmlm2/index.dhtml
  selection-query-1:
    cs-uri-query:
      - fname=&language=../../../../../../../../../../etc/passwd%00.jpg&lname=&sponsor=gdi&template=11
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
