title: EasyCVR video management - Users Information Exposure
id: b93702d1-1b96-42b7-942a-ce450bfeb4f3
status: experimental
logsource:
  product: webserver
description: 'EasyCVR video management platform has leaked user information

  '
reference: 'Generated by converting Nuclei Template. Template ID: easycvr-info-leak
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pussycat0x; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /api/v1/userlist
  selection-query-1:
    cs-uri-query:
      - pageindex=0&pagesize=10
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
