title: OA E-Weaver SptmForPortalThumbnail - Arbitrary File Read
id: 721068f0-616c-45ba-a8af-485fdb6df46c
status: experimental
logsource:
  product: webserver
description: 'The controllable preview parameters of SptmForPortalThumbnail.jsp are
  not filtered and are directly spliced to the web root directory for file downloading.

  '
reference: 'Generated by converting Nuclei Template. Template ID: weaver-sptmforportalthumbnail-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /portal/SptmForPortalThumbnail.jsp
  selection-query-1:
    cs-uri-query:
      - preview=portal/SptmForPortalThumbnail.jsp
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
