title: Wanhu OA smartUpload.jsp - Arbitrary File Upload
id: f8ad7525-245f-4442-8032-beac546c3c8f
status: experimental
logsource:
  product: webserver
description: 'Wanhu OA smartUpload.jsp file has a file upload interface and does not
  filter file types, resulting in arbitrary file upload vulnerabilities. Malicious
  JSP files can be uploaded directly.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wanhuoa-smartupload-file-upload
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /defaultroot/extension/smartUpload.jsp
  selection-query-1:
    cs-uri-query:
      - path=information&fileName=infoPicName&saveName=infoPicSaveName&tableName=infoPicTable&fileMaxSize=0&fileMaxNum=0&fileType=gif,jpg,bmp,jsp,png&fileMinWidth=0&fileMinHeight=0&fileMaxWidth=0&fileMaxHeight=0
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
