title: JexBoss - Remote Code Execution
id: c134b345-cf6e-4c45-804b-f59bb824b82d
status: experimental
logsource:
  product: webserver
description: JexBoss is susceptible to remote code execution via the webshell. An
  attacker can execute malware, obtain sensitive information, modify data, and/or
  gain full control over a compromised system without entering necessary credentials.
reference: 'Generated by converting Nuclei Template. Template ID: jexboss-backdoor
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: UnkL4b; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /jexws/jexws.jsp
      - /jexws4/jexws4.jsp
      - /jexinv4/jexinv4.jsp
      - /jbossass/jbossass.jsp
  selection-query-1:
    cs-uri-query:
      - ppp={{url_encode('{{command}}')}}
      - ppp={{url_encode('{{command}}')}}
      - ppp={{url_encode('{{command}}')}}
      - ppp={{url_encode('{{command}}')}}
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
