title: Wanhu OA DownloadServlet - Remote File Disclosure
id: c48d14e7-f5e8-443a-8145-dbaf90ff2a29
status: experimental
logsource:
  product: webserver
description: 'There is an arbitrary file reading vulnerability in the Wanhu OA DownloadServlet
  interface. An attacker can use the vulnerability to read sensitive files in the
  server and obtain sensitive information.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wanhuoa-downloadservlet-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: wpsec; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /defaultroot/DownloadServlet
  selection-query-1:
    cs-uri-query:
      - modeType=0&key=x&path=..&FileName=WEB-INF/classes/fc.properties&name=x&encrypt=x&cd=&downloadAll=2
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
