title: Moodle Jsmol - Cross-Site Scripting
id: d1d143f5-9172-41b7-880f-ee4b783c2c85
status: experimental
logsource:
  product: webserver
description: Moodle contains a cross-site scripting vulnerability via the Jsmol plugin
  and may also be susceptible to local file inclusion or server-side-request forgery.
  An attacker can execute arbitrary script in the browser of an unsuspecting user
  and steal cookie-based authentication credentials and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: moodle-filter-jmol-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: madrobot; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /filter/jmol/js/jsmol/php/jsmol.php
  selection-query-1:
    cs-uri-query:
      - call=saveFile&data=%3Cscript%3Ealert(%27XSS%27)%3C/script%3E&mimetype=text/html
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
