title: Seeyon OA A6 createMysql.jsp Database - Information Disclosure
id: 5c971059-4327-41d8-8e54-b6730e3ab449
status: experimental
logsource:
  product: webserver
description: 'Seeyon OA A6 has leaked sensitive database information. An attacker
  can obtain the database account and password MD5 by accessing a specific URL.

  '
reference: 'Generated by converting Nuclei Template. Template ID: seeyon-createmysql-exposure
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /yyoa/createMysql.jsp
      - /yyoa/ext/createMysql.jsp
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
