title: Tinymce Thumbnail Gallery <=1.0.7 - Local File Inclusion
id: eaabb99d-40e5-49e2-a6ad-a6e96673da62
status: experimental
logsource:
  product: webserver
description: Tinymce Thumbnail Gallery 1.0.7 and before are vulnerable to local file
  inclusion via download-image.php.
reference: 'Generated by converting Nuclei Template. Template ID: wp-tinymce-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/tinymce-thumbnail-gallery/php/download-image.php
  selection-query-1:
    cs-uri-query:
      - href=../../../../wp-config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
