title: VMWare Cloud - Cross Site Scripting
id: 0149f283-e467-445a-b6a4-955a17123fa7
status: experimental
logsource:
  product: webserver
description: VMWare Cloud is vulnerable to Reflected Cross Site Scripting vulnerability.
reference: 'Generated by converting Nuclei Template. Template ID: vmware-cloud-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: tess; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /login/
  selection-query-1:
    cs-uri-query:
      - redirectTo=/tenant/e&service=</script><script>alert(document.domain)</script>
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
