title: Tongda User Session Disclosure
id: 7af4eabc-3976-4cfd-8861-b7ba2e3f912c
status: experimental
logsource:
  product: webserver
description: Tongda User session exposed.
reference: 'Generated by converting Nuclei Template. Template ID: tongda-session-disclosure
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: POST
  selection-paths-1:
    cs-uri-stem:
      - /general/userinfo.php
  selection-query-1:
    cs-uri-query:
      - UID=1
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
