title: MPSec ISG1000 - Local File Inclusion
id: 61a03d6d-917d-4693-873e-9d234a10c374
status: experimental
logsource:
  product: webserver
description: MPSec ISG1000 is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: mpsec-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /webui/
      - /webui/
  selection-query-1:
    cs-uri-query:
      - g=sys_dia_data_down&file_name=../../../../../../../../../../../../etc/passwd
      - g=sys_dia_data_down&file_name=../../../../../../../../../../../../c:/windows/win.ini
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
