title: Surreal ToDo 0.6.1.2 - Local File Inclusion
id: 8403f076-6ca6-4eb6-9910-d3a54b9e317c
status: experimental
logsource:
  product: webserver
description: 'Surreal ToDo 0.6.1.2 is vulnerable to local file inclusion via index.php
  and the content parameter.

  '
reference: 'Generated by converting Nuclei Template. Template ID: surrealtodo-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: arafatansari; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - content=../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
