title: Weaver E-Cology HrmCareerApplyPerView - SQL Injection
id: e93b37aa-cab5-4efd-9ea9-b05d9a1dd592
status: experimental
logsource:
  product: webserver
description: 'There is a SQL injection vulnerability in the HrmCareerApplyPerView.jsp
  file of Panwei OA E-Cology. An attacker can obtain sensitive files in the server
  database through the vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: weaver-ecology-hrmcareer-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /pweb/careerapply/HrmCareerApplyPerView.jsp
  selection-query-1:
    cs-uri-query:
      - id=1%20union%20select%201,2,sys.fn_sqlvarbasetostr(HashBytes('MD5','{{num}}')),4,5,6,7
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
