title: Tiki Wiki CMS Groupware 5.2 - Cross-Site Scripting
id: 92601ada-9635-49cf-9d9f-00868bdd3e17
status: experimental
logsource:
  product: webserver
description: Tiki Wiki CMS Groupware 5.2 contains a cross-site scripting vulnerability.
  An attacker can execute arbitrary script in the browser of an unsuspecting user
  in the context of the affected site. This can allow the attacker to steal cookie-based
  authentication credentials and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: tikiwiki-reflected-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: madrobot; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /tiki-5.2/tiki-edit_wiki_section.php
      - /tiki-edit_wiki_section.php
  selection-query-1:
    cs-uri-query:
      - type=%22%3E%3Cscript%3Ealert(31337)%3C/script%3E
      - type=%22%3E%3Cscript%3Ealert(31337)%3C/script%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
