title: IDoc View - Arbitrary File Read
id: 39f67378-ede0-4acc-ba8d-8cb578b2f674
status: experimental
logsource:
  product: webserver
description: 'Converted from a Nuclei template; ID: idocview-lfi'
reference: 'Generated by converting Nuclei Template. Template ID: idocview-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /doc/upload
  selection-query-1:
    cs-uri-query:
      - token=testtoken&url=file:///C:/windows/win.ini&name={{file}}.txt
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
