title: Zhiyuan OA Session Leak
id: 54a96475-73c8-4422-aac7-6b351689cc9b
status: experimental
logsource:
  product: webserver
description: A vulnerability in Zhiyuan OA allows remote unauthenticated users access
  to sensitive session information via the 'getSessionList.jsp' endpoint.
reference: 'Generated by converting Nuclei Template. Template ID: zhiyuan-oa-session-leak
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /yyoa/ext/https/getSessionList.jsp
  selection-query-1:
    cs-uri-query:
      - cmd=getAll
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
