title: WordPress Ad Widget 2.11.0 - Local File Inclusion
id: 7761254c-4316-4ee3-b8e1-fbb430ad6c4f
status: experimental
logsource:
  product: webserver
description: 'WordPress Ad Widget 2.11.0 is vulnerable to local file inclusion. Exploiting
  this issue may allow an attacker to obtain sensitive information that could aid
  in further attacks.

  '
reference: 'Generated by converting Nuclei Template. Template ID: ad-widget-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/ad-widget/views/modal/
  selection-query-1:
    cs-uri-query:
      - step=../../../../../../../etc/passwd%00
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
