title: WordPress Slideshow - Cross-Site Scripting
id: 928b1ee0-f34e-4746-b806-8a36bc61b181
status: experimental
logsource:
  product: webserver
description: WordPress Slideshow plugin contains multiple cross-site scripting vulnerabilities.
  An attacker can execute arbitrary script in the browser of an unsuspecting user
  in the context of the affected site. This can allow the attacker to steal cookie-based
  authentication credentials and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: wp-slideshow-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: daffainfo; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/slideshow-jquery-image-gallery/views/SlideshowPlugin/slideshow.php
  selection-query-1:
    cs-uri-query:
      - randomId=%3C%2Fscript%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
