title: WordPress Real Estate 7 Theme <= 3.3.4 - Cross-Site Scripting
id: 6d994e22-1805-462e-ab5b-b30216fb27cd
status: experimental
logsource:
  product: webserver
description: 'The Real Estate 7 premium theme for WordPress is vulnerable to Reflected
  Cross-Site Scripting (XSS) attack vector in versions up to, and including, v3.3.4
  via the ''ct_additional_features'' option due to insufficient input sanitization
  and output escaping. This vulnerability allows unauthenticated attackers to inject
  malicious JavaScript payload in the search page that execute if they can trick a
  user into performing an action such as clicking on a link.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wp-real-estate-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: Harsh; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - ct_keyword=%22%3E%3Cimg%20src%3Dx%20onerror%3Dprompt%28document.domain%29%3E&ct_city=0&ct_state=0&ct_zipcode=0&search-listings=true&ct_property_type=0&ct_beds=0&ct_baths=0&ct_price_from&ct_price_to
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
