title: WEMS Enterprise Manager - Cross-Site Scripting
id: b0da5864-e16d-4b37-8141-297ebb593989
status: experimental
logsource:
  product: webserver
description: WEMS Enterprise Manager contains a cross-site scripting vulnerability
  via the /guest/users/forgotten endpoint and the email parameter, which allows a
  remote attacker to inject arbitrary JavaScript into the response return by the server.
reference: 'Generated by converting Nuclei Template. Template ID: wems-manager-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /guest/users/forgotten
  selection-query-1:
    cs-uri-query:
      - email=%22%3E%3Cscript%3Econfirm(document.domain)%3C/script%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
