title: OfficeWeb365 Indexs Interface - Arbitary File Read
id: 7935c6e0-b602-46f3-8e3f-7fe75f671c89
status: experimental
logsource:
  product: webserver
description: 'There is any file reading in the officeWeb365 Indexs interface.

  '
reference: 'Generated by converting Nuclei Template. Template ID: office365-indexs-fileread
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /Pic/Indexs
  selection-query-1:
    cs-uri-query:
      - imgs=DJwkiEm6KXJZ7aEiGyN4Cz83Kn1PLaKA09
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
