title: ThinkPHP - Remote Code Execution
id: 249deb2e-6da5-40fc-bab8-e7496ffbd8d6
status: experimental
logsource:
  product: webserver
description: ThinkPHP 5.0.22 and 5.1.29 are susceptible to remote code execution if
  the website doesn't have mandatory routing enabled, which is the default setting.
  An attacker can execute malware, obtain sensitive information, modify data, and/or
  gain full control over a compromised system without entering necessary credentials.
reference: 'Generated by converting Nuclei Template. Template ID: thinkphp-5022-rce
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dr_set; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - ''
  selection-query-1:
    cs-uri-query:
      - s=index/think\app/invokefunction&function=call_user_func_array&vars[0]=phpinfo&vars[1][]=1
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
