title: Dahua EIMS - Remote Command Execution
id: 992ee254-1ea6-4031-8bee-ec804a885ca1
status: experimental
logsource:
  product: webserver
description: 'Dahua EIMS capture_handle interface allows remote command execution.

  '
reference: 'Generated by converting Nuclei Template. Template ID: dahua-eims-rce Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /config/asst/system_setPassWordValidate.action/capture_handle.action
  selection-query-1:
    cs-uri-query:
      - captureFlag=true&captureCommand=ping%20{{interactsh-url}}%20index.pcap
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
