title: Jinhe OA C6 download.jsp - Arbitary File Read
id: 38e46b75-c86d-48e0-a44b-573a00787d43
status: experimental
logsource:
  product: webserver
description: 'There is an arbitrary file read vulnerability in Jinhe OA C6 download.jsp
  file, through which an attacker can obtain sensitive information in the server

  '
reference: 'Generated by converting Nuclei Template. Template ID: jinhe-oa-c6-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /C6/Jhsoft.Web.module/testbill/dj/download.asp
  selection-query-1:
    cs-uri-query:
      - filename=/c6/web.config
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
