title: UEditor - Arbitrary File Upload
id: 41766674-8685-4f6e-aac6-08c074f1c2bc
status: experimental
logsource:
  product: webserver
description: UEditor contains an arbitrary file upload vulnerability. An attacker
  can upload arbitrary files to the server, which in turn can be used to make the
  application execute file content as code, As a result, an attacker can possibly
  obtain sensitive information, modify data, and/or execute unauthorized operations.
reference: 'Generated by converting Nuclei Template. Template ID: ueditor-file-upload
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /ueditor/net/controller.ashx
  selection-query-1:
    cs-uri-query:
      - action=catchimage&encode=utf-8
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
