title: McAfee ePolicy Orchestrator - Arbitrary File Upload
id: ff810b8f-224f-4b4a-b579-816a5d3ce7ba
status: experimental
logsource:
  product: webserver
description: 'McAfee ePolicy Orchestrator (ePO) is vulnerable to a ZipSlip vulnerability
  which allows arbitrary file upload when archives are unpacked if the names of the
  packed files are not properly sanitized. An attacker can create archives with files
  containing "../" in their names, making it possible to upload arbitrary files to
  arbitrary directories or overwrite existing ones during archive extraction.

  '
reference: 'Generated by converting Nuclei Template. Template ID: mcafee-epo-rce Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dwisiswant0; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /stat.jsp
  selection-query-1:
    cs-uri-query:
      - cmd=chcp+437+%7c+dir
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
