title: Wooyun - Local File Inclusion
id: 42315d41-2903-4da4-983f-b1789fa36b6f
status: experimental
logsource:
  product: webserver
description: 'Wooyun is vulnerable to local file inclusion.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wooyun-path-traversal
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /NCFindWeb
  selection-query-1:
    cs-uri-query:
      - service=IPreAlertConfigService&filename=../../ierp/bin/prop.xml
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
