title: JavaMelody - Cross-Site Scripting
id: 73dd18c0-6e76-412d-8c46-68b29f951d12
status: experimental
logsource:
  product: webserver
description: JavaMelody contains a cross-site scripting vulnerability via the monitoring
  parameter. An attacker can execute arbitrary script in the context of the affected
  site. This can allow the attacker to steal cookie-based authentication credentials
  and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: java-melody-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: kailashbohara; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /monitoring
  selection-query-1:
    cs-uri-query:
      - part=graph&graph=usedMemory%3C%2Fscript%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
