title: Tongda OA v2014 Get Contactlistt - Sensitive Information Disclosure
id: b0b3221b-3d28-43a1-b163-04219eee5258
status: experimental
logsource:
  product: webserver
description: 'There is an information leakage vulnerability in the get_contactlist.php
  file of Tongda OA v2014. Attackers can obtain sensitive information through the
  vulnerability and conduct further attacks.

  '
reference: 'Generated by converting Nuclei Template. Template ID: tongda-contact-list-exposure
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /mobile/inc/get_contactlist.php
  selection-query-1:
    cs-uri-query:
      - P=1&KWORD=%25&isuser_info=3
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
