title: Joomla! Component com_sef - Local File Inclusion
id: e89f995c-e92f-4b90-b1f1-8b81865d4641
status: experimental
logsource:
  product: webserver
description: A local file inclusion vulnerability in the Jvehicles (com_jvehicles)
  component version 1.0 for Joomla! allows remote attackers to load arbitrary files
  via the controller parameter in index.php.
reference: 'Generated by converting Nuclei Template. Template ID: joomla-jvehicles-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: daffainfo; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - option=com_jvehicles&controller=../../../../../../../../../../etc/passwd%00
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
