title: WordPress Mailchimp 4 Debug Log Exposure
id: 5db8d7eb-b494-44d4-95c8-59e151918eed
status: experimental
logsource:
  product: webserver
description: Searches for Mailchimp log exposure by attempting to query the debug
  log endpoint on wp-content
reference: 'Generated by converting Nuclei Template. Template ID: wp-mailchimp-log-exposure
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: aashiq; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/uploads/mc4wp-debug.log
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
