title: Sangfor EDR - Authentication Bypass
id: d7b3a7d3-1c57-4374-b5ff-90f4f037f7f7
status: experimental
logsource:
  product: webserver
description: 'Sangfor EDR contains an authentication bypass vulnerability. An attacker
  can access the system with admin privileges by accessing the login page directly
  using a provided username rather than going through the login screen without providing
  a username. This makes it possible to obtain sensitive information, modify data,
  and/or execute unauthorized operations.

  '
reference: 'Generated by converting Nuclei Template. Template ID: sangfor-edr-auth-bypass
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /ui/login.php
  selection-query-1:
    cs-uri-query:
      - user=admin
  selection-status-code-1:
    sc-status: 302
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
