title: Joomla! com_fabrik 3.9.11 - Local File Inclusion
id: c2e288f2-0b16-45c2-bfed-8c8e1cd9b71f
status: experimental
logsource:
  product: webserver
description: Joomla! com_fabrik 3.9.11 is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: joomla-com-fabrik-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - option=com_fabrik&task=plugin.pluginAjax&plugin=image&g=element&method=onAjax_files&folder=../../../../../../../../../../../../../../../etc/
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
