title: Sangfor EDR 3.2.17R1/3.2.21 - Remote Code Execution
id: e2cd48b5-2f4f-437f-8c03-52a65debeaac
status: experimental
logsource:
  product: webserver
description: Sangfor EDR 3.2.17R1/3.2.21 allows remote unauthenticated users to to
  execute arbitrary commands.
reference: 'Generated by converting Nuclei Template. Template ID: sangfor-edr-rce
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: POST
  selection-paths-1:
    cs-uri-stem:
      - /api/edr/sangforinter/v2/cssp/slog_client
  selection-query-1:
    cs-uri-query:
      - token=eyJtZDUiOnRydWV9
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
