title: Moodle - Cross-Site Scripting
id: 67466c96-423d-4b9e-a6c9-a0aa304d4d09
status: experimental
logsource:
  product: webserver
description: Moodle 3.10 to 3.10.3, 3.9 to 3.9.6, 3.8 to 3.8.8, and earlier unsupported
  versions contain a cross-site scripting vulnerability via the redirect_uri parameter.
reference: 'Generated by converting Nuclei Template. Template ID: moodle-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: hackergautam; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /mod/lti/auth.php
  selection-query-1:
    cs-uri-query:
      - redirect_uri=javascript:alert('{{randstr}}')
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
