title: WordPress Weekender Newspaper 9.0 - Open Redirect
id: bea395a0-3c72-49ff-890e-ab4135a34d36
status: experimental
logsource:
  product: webserver
description: WordPress Weekender Newspaper theme 9.0 contains an open redirect vulnerability.
  An attacker can redirect a user to a malicious site and possibly obtain sensitive
  information, modify data, and/or execute unauthorized operations.
reference: 'Generated by converting Nuclei Template. Template ID: weekender-newspaper-open-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/themes/weekender/friend.php
  selection-query-1:
    cs-uri-query:
      - id=aHR0cHM6Ly9pbnRlcmFjdC5zaA==
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
