title: AVCON6 org_execl_download.action - Arbitrary File Download
id: 2a5daf16-f7be-4242-81bc-d2349a13d070
status: experimental
logsource:
  product: webserver
description: 'Arbitrary File Download vulnerability in the org_execl_download.action
  of the AVCON6 system management platform, through which an attacker can download
  arbitrary files from the server

  '
reference: 'Generated by converting Nuclei Template. Template ID: avcon6-execl-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /org_execl_download.action
  selection-query-1:
    cs-uri-query:
      - filename=../../../../../../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
