title: Wordpress Aspose Cloud eBook Generator - Local File Inclusion
id: 06f16b81-3398-4a03-853a-72897f275500
status: experimental
logsource:
  product: webserver
description: Wordpress Aspose Cloud eBook Generator is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: aspose-file-download
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/aspose-cloud-ebook-generator/aspose_posts_exporter_download.php
  selection-query-1:
    cs-uri-query:
      - file=../../../wp-config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
