title: EasyImage down.php - Arbitrary File Read
id: c0b34677-3009-43aa-b878-f09654cae67e
status: experimental
logsource:
  product: webserver
description: down.php file in EasyImage is vulnerable to arbitrary file read.
reference: 'Generated by converting Nuclei Template. Template ID: easyimage-downphp-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /application/down.php
  selection-query-1:
    cs-uri-query:
      - dw=config/config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
