title: Taiwanese Travel - Local File Inclusion
id: 6fc69042-3b9d-4a7e-a21c-0266a5033751
status: experimental
logsource:
  product: webserver
description: 'The vulnerability in ''/index.php?page='' allows for Local File Inclusion
  (LFI), granting attackers the ability to include and potentially execute files on
  the server, compromising the application''s security

  '
reference: 'Generated by converting Nuclei Template. Template ID: taiwanese-travel-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - page=/etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
