title: WordPress Members List <4.3.7 - Cross-Site Scripting
id: ace119a5-24d8-408c-87f6-b0654899d25e
status: experimental
logsource:
  product: webserver
description: WordPress Members List 4.3.7 does not sanitize and escape some parameters
  in various pages before outputting them back, leading to reflected cross-site scripting
  vulnerabilities.
reference: 'Generated by converting Nuclei Template. Template ID: members-list-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: Akincibor; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/members-list/admin/view/user.php
  selection-query-1:
    cs-uri-query:
      - page=%22%3E%3Cimg%20src%20onerror=alert(document.domain)%20x
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
