title: Oracle Fatwire 6.3 - Path Traversal
id: bc54a7e6-8500-45e9-a5c9-b26449e05f46
status: experimental
logsource:
  product: webserver
description: 'Oracle Fatwire 6.3 suffers from a path traversal vulnerability in the
  getSurvey.jsp endpoint.

  '
reference: 'Generated by converting Nuclei Template. Template ID: oracle-fatwire-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: Bernardo Rodrigues @bernardofsr; Converted to Sigma
  by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /cs/career/getSurvey.jsp
  selection-query-1:
    cs-uri-query:
      - fn=../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../../etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
