title: WordPress Securimage-WP 3.2.4 - Cross-Site Scripting
id: c53f1872-5bcc-4ddb-bd20-bd4646783540
status: experimental
logsource:
  product: webserver
description: WordPress Securimage-WP 3.2.4 plugin contains a cross-site scripting
  vulnerability via siwp_test.php. An attacker can execute arbitrary script in the
  browser of an unsuspecting user in the context of the affected site. This can allow
  the attacker to steal cookie-based authentication credentials and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: wp-securimage-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: daffainfo; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/securimage-wp/siwp_test.php/%22/%3E%3Cscript%3Ealert(1);%3C/script%3E
  selection-query-1:
    cs-uri-query:
      - tested=1
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
