title: Tongda OA Meeting - Unauthorized Access
id: 7577062e-07d7-4710-bad7-1cf56ce0b3c4
status: experimental
logsource:
  product: webserver
description: 'Tongda Meeting Unauthorized Access were Detected.

  '
reference: 'Generated by converting Nuclei Template. Template ID: tongda-meeting-unauth
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /general/calendar/arrange/get_cal_list.php
  selection-query-1:
    cs-uri-query:
      - starttime=1548058874&endtime=33165447106&view=agendaDay
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
