title: TPshop - Local File Inclusion
id: 05748d36-93d0-4cf8-8858-a973ccbd4691
status: experimental
logsource:
  product: webserver
description: TPshop is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: tpshop-directory-traversal
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php/Home/uploadify/fileList
  selection-query-1:
    cs-uri-query:
      - type=.+&path=../../../
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
