title: Xerox DC260 EFI Fiery Controller Webtools 2.0 - Local File Inclusion
id: d88d403b-e6d6-4d18-928b-363617eb8f86
status: experimental
logsource:
  product: webserver
description: Xerox DC260 EFI Fiery Controller Webtools 2.0 is vulnerable to local
  file inclusion because input passed thru the 'file' GET parameter in 'forceSave.php'
  script is not properly sanitized before being used to read files. This can be exploited
  by an unauthenticated attacker to read arbitrary files on the affected system.
reference: 'Generated by converting Nuclei Template. Template ID: xerox-efi-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: gy741; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wt3/forceSave.php
  selection-query-1:
    cs-uri-query:
      - file=/etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
