title: CS-Cart - Local File Inclusion
id: 5f5f37c7-9126-488b-82aa-b3a46bede6a7
status: experimental
logsource:
  product: webserver
description: CS-Cart is vulnerable to local file inclusion because it allows remote
  unauthenticated attackers to access locally stored files and reveal their content.
reference: 'Generated by converting Nuclei Template. Template ID: cs-cart-unauthenticated-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /classes/phpmailer/class.cs_phpmailer.php
  selection-query-1:
    cs-uri-query:
      - classes_dir=../../../../../../../../../../../etc/passwd%00
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
