title: Twig PHP <2.4.4 template engine - SSTI
id: 3154ef50-57c1-4e4f-9fef-df2ab19a418f
status: experimental
logsource:
  product: webserver
description: A vulnerability in Twig PHP allows remote attackers to cause the product
  to execute arbitrary commands via an SSTI vulnerability.
reference: 'Generated by converting Nuclei Template. Template ID: twig-php-ssti Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: madrobot; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /search
  selection-query-1:
    cs-uri-query:
      - search_key=%7B%7B1337*1338%7D%7D
  selection-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
