title: Weaver E-Cology `getsqldata` - SQL Injection
id: 418f3839-ae9f-41c0-810c-44fc5cfa9056
status: experimental
logsource:
  product: webserver
description: 'When the getSqlData interface of the Panwei e-cology OA system uses
  the mssql database, the built-in SQL statements are not spliced strictly, resulting
  in a SQL injection vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: weaver-ecology-getsqldata-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /Api/portal/elementEcodeAddon/getSqlData
      - /Api/portal/elementEcodeAddon/getSqlData
  selection-query-1:
    cs-uri-query:
      - sql=select%20substring(sys.fn_sqlvarbasetostr(hashbytes('MD5','{{num}}')),3,32)
      - sql=
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
