title: WordPress Flow-Flow Social Stream <=3.0.71 - Cross-Site Scripting
id: 3393017d-0212-46b1-9a4c-21d7d4153c0b
status: experimental
logsource:
  product: webserver
description: WordPress Flow-Flow Social Stream 3.0.7.1 and prior is vulnerable to
  cross-site scripting.
reference: 'Generated by converting Nuclei Template. Template ID: flow-flow-social-stream-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: alph4byt3; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-admin/admin-ajax.php
  selection-query-1:
    cs-uri-query:
      - action=fetch_posts&stream-id=1&hash=%3Cimg%20src=x%20onerror=alert(document.domain)%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
