title: Sangfor Log Center - Remote Command Execution
id: 4d5c661e-1425-4b81-a945-6ed61bb7b824
status: experimental
logsource:
  product: webserver
description: Sangfor Log Center is vulnerable to RCE.
reference: 'Generated by converting Nuclei Template. Template ID: sangfor-cphp-rce
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /tool/log/c.php
  selection-query-1:
    cs-uri-query:
      - strip_slashes=system&host=ipconfig
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
