title: ThinkCMF - Local File Inclusion
id: b6ab0ad1-3258-4b93-b1e4-eb3721343f7f
status: experimental
logsource:
  product: webserver
description: ThinkCMF is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: thinkcmf-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - a=display&templateFile=README.md
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
