title: Wuzhicms 4.1.0 - SQL Injection
id: 49e52f9f-8cf9-4cba-a147-496512dcbbb3
status: experimental
logsource:
  product: webserver
description: 'Wuzhicms 4.1.0 contains a SQL injection vulnerability via the grouppid
  parameter of /coreframe/app/member/admin/group.php. An attacker can possibly obtain
  sensitive information from a database, modify data, and execute unauthorized administrative
  operations in the context of the affected site.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wuzhicms-sqli Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /api/sms_check.php
  selection-query-1:
    cs-uri-query:
      - param=1%27%20and%20updatexml(1,concat(0x7e,(SELECT%20md5({{num}})),0x7e),1)--%20
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
