title: WordPress ChurcHope Theme <= 2.1 - Local File Inclusion
id: 30cdd6da-464e-4d6c-bdf6-158b3bf9392e
status: experimental
logsource:
  product: webserver
description: WordPress ChurcHope Theme <= 2.1 is susceptible to local file inclusion.
  The vulnerability is caused by improper filtration of user-supplied input passed
  via the 'file' HTTP GET parameter to the '/lib/downloadlink.php' script, which is
  publicly accessible.
reference: 'Generated by converting Nuclei Template. Template ID: churchope-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/themes/churchope/lib/downloadlink.php
  selection-query-1:
    cs-uri-query:
      - file=../../../../wp-config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
