title: BEWARD N100 H.264 VGA IP Camera M2.1.6 - Arbitrary File Disclosure
id: 0965c0d7-b5a0-4e57-be0e-8a281fde5876
status: experimental
logsource:
  product: webserver
description: The N100 compact color IP camera suffers from an authenticated file disclosure
  vulnerability. Input passed via the READ.filePath parameter in fileread script is
  not properly verified before being used to read files. This can be exploited to
  disclose the contents of arbitrary files via absolute path or via the SendCGICMD
  API.
reference: 'Generated by converting Nuclei Template. Template ID: beward-ipcamera-disclosure
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: geeknik; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /cgi-bin/operator/fileread
  selection-query-1:
    cs-uri-query:
      - READ.filePath=/etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
