title: ECSIMAGING PACS <= 6.21.5 - Command Execution and Local File Inclusion
id: 93927c67-79dc-4793-9c4d-6f986149510d
status: experimental
logsource:
  product: webserver
description: ECSIMAGING PACS Application 6.21.5 and below suffer from a command injection
  vulnerability and a local file include vulnerability. The 'file' parameter on the
  page /showfile.php can be exploited to perform command execution or local file inclusion.
  Often on ECSIMAGING PACS, the www-data user has sudo NOPASSWD access.
reference: 'Generated by converting Nuclei Template. Template ID: ecsimagingpacs-rce
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /showfile.php
  selection-query-1:
    cs-uri-query:
      - file=/etc/passwd
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
