title: Wanhu OA OfficeServerServlet - Arbitrary File Upload
id: 68562472-9186-40c7-ae2a-7599a0d8dfea
status: experimental
logsource:
  product: webserver
description: Wanhu OA officeserverservlet file upload vulnerability
reference: 'Generated by converting Nuclei Template. Template ID: wanhuoa-officeserverservlet-file-upload
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /defaultroot/officeserverservlet
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
