title: Zhiyuan Oa A6-s info Leak
id: f9b22a5b-6dc0-4406-9f43-8397cef8249c
status: experimental
logsource:
  product: webserver
description: 'Converted from a Nuclei template; ID: zhiyuan-oa-info-leak'
reference: 'Generated by converting Nuclei Template. Template ID: zhiyuan-oa-info-leak
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /yyoa/DownExcelBeanServlet
  selection-query-1:
    cs-uri-query:
      - contenttype=username&contentvalue=&state=1&per_id=0
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
