title: Email Verification for WooCommerce < 1.8.2 - Loose Comparison to Authentication
  Bypass
id: f7ef3218-d22b-474c-95de-357bff02dd26
status: experimental
logsource:
  product: webserver
description: 'Email Verification for WooCommerce Wordpress plugin prior to version
  1.8.2  contains a loose comparison issue which could allow any user to log in as
  administrator.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wp-woocommerce-email-verification
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: random_robbie,daffianfo; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /my-account/
      - /
  selection-query-1:
    cs-uri-query:
      - alg_wc_ev_verify_email=eyJpZCI6MSwiY29kZSI6MH0=
      - alg_wc_ev_verify_email=eyJpZCI6MSwiY29kZSI6MH0=
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
