title: WordPress ProStore <1.1.3 - Open Redirect
id: 37a9671e-eaa0-4d5a-a77c-722e39650227
status: experimental
logsource:
  product: webserver
description: WordPress ProStore theme before 1.1.3 contains an open redirect vulnerability.
  An attacker can redirect a user to a malicious site and possibly obtain sensitive
  information, modify data, and/or execute unauthorized operations.
reference: 'Generated by converting Nuclei Template. Template ID: wp-prostore-open-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/themes/prostore/go.php
  selection-query-1:
    cs-uri-query:
      - https://interact.sh/
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
