title: Sassy Social Share <=3.3.3 - Cross-Site Scripting
id: 98383fad-ffd3-4ce6-88a8-3e774d800e58
status: experimental
logsource:
  product: webserver
description: 'WordPress Sassy Social Share 3.3.3 and prior is vulnerable to cross-site
  scripting because certain AJAX endpoints return JSON data with no Content-Type header
  set and then use the default text/html. In other words, any JSON that has HTML will
  be rendered as such.

  '
reference: 'Generated by converting Nuclei Template. Template ID: sassy-social-share-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: Random_Robbie; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-admin/admin-ajax.php
  selection-query-1:
    cs-uri-query:
      - action=heateor_sss_sharing_count&urls[%3Cimg%20src%3dx%20onerror%3dalert(document.domain)%3E]=
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
