title: ECTouch 2 - SQL Injection
id: 9d6893a0-df50-4751-af64-61a72bdf0988
status: experimental
logsource:
  product: webserver
description: ECTouch 2 contains a SQL injection vulnerability. An attacker can possibly
  obtain sensitive information from a database, modify data, and execute unauthorized
  administrative operations in the context of the affected site.
reference: 'Generated by converting Nuclei Template. Template ID: etouch-v2-sqli Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /upload/mobile/index.php
  selection-query-1:
    cs-uri-query:
      - c=category&a=asynclist&price_max=1.0%20AND%20(SELECT%201%20FROM(SELECT%20COUNT(*),CONCAT(0x7e,md5({{num}}),0x7e,FLOOR(RAND(0)*2))x%20FROM%20INFORMATION_SCHEMA.CHARACTER_SETS%20GROUP%20BY%20x)a)''
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
