title: NETGEAR WAC124 - Authentication Bypass
id: 6a92c3e1-3b9b-4ec0-8a29-1663ae3a0fd3
status: experimental
logsource:
  product: webserver
description: 'NETGEAR WAC124 AC2000 routers contain an authentication bypass vulnerability.
  An attacker can gain access by bypassing proper authentication, thereby making it
  possible to obtain sensitive information, modify data, and/or execute unauthorized
  operations.

  '
reference: 'Generated by converting Nuclei Template. Template ID: netgear-wac124-router-auth-bypass
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: gy741; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /setup.cgi
  selection-query-1:
    cs-uri-query:
      - next_file=debug.htm&x=currentsetting.htm
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
