title: HomeAutomation 3.3.2 - Open Redirect
id: d8b7d6da-9ccc-40e1-982b-7891fca5737b
status: experimental
logsource:
  product: webserver
description: HomeAutomation 3.3.2 contains an open redirect vulnerability. An attacker
  can inject a redirect URL via the api.php endpoint and the redirect parameter, making
  it possible to redirect a user to a malicious site and possibly obtain sensitive
  information, modify data, and/or execute unauthorized operations.
reference: 'Generated by converting Nuclei Template. Template ID: homeautomation-v3-openredirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /homeautomation_v3_3_2/api.php
  selection-query-1:
    cs-uri-query:
      - do=groups/toggle&groupid=1&status=1&redirect=https://interact.sh/
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
