title: WordPress bbPress Plugin Directory Listing
id: 710809e0-e318-4150-8611-29bce1bbb162
status: experimental
logsource:
  product: webserver
description: Searches for sensitive directories present in the bbpress wordpress plugin.
reference: 'Generated by converting Nuclei Template. Template ID: wordpress-bbpress-plugin-listing
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/bbpress/
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
