title: Jira Unauthenticated Project Categories
id: f4f3bfc4-4d71-42fe-bdf6-838ae8badfb4
status: experimental
logsource:
  product: webserver
description: 'Converted from a Nuclei template; ID: jira-unauthenticated-projectcategories'
reference: 'Generated by converting Nuclei Template. Template ID: jira-unauthenticated-projectcategories
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: TESS; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /rest/api/2/projectCategory
  selection-query-1:
    cs-uri-query:
      - maxResults=1000
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
