title: WordPress Ambience Theme <=1.0 - Cross-Site Scripting
id: f0b336e0-e77a-4835-ac69-2a9b02c075a2
status: experimental
logsource:
  product: webserver
description: 'WordPress Ambience Theme 1.0 and earlier was affected by a cross-site
  scripting vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wp-ambience-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: daffainfo; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/themes/ambience/thumb.php
  selection-query-1:
    cs-uri-query:
      - src=%3Cbody%20onload%3Dalert(1)%3E.jpg
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
