title: Wanhu OA download_ftp.jsp - Arbitrary File Read
id: 67f14f7c-f1dd-41a0-a162-d1bc116cd597
status: experimental
logsource:
  product: webserver
description: 'There is an arbitrary file download vulnerability in the Wanhu OA download_ftp.jsp
  file. An attacker can download any file on the server through the vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wanhu-download-ftp-file-read
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /defaultroot/download_ftp.jsp
  selection-query-1:
    cs-uri-query:
      - path=/../WEB-INF/&name=aaa&FileName=web.xml
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
