title: ThinkPHP 5.0.23 - Remote Code Execution
id: 418f1b3f-0f08-4bff-ab2a-d16a49635456
status: experimental
logsource:
  product: webserver
description: ThinkPHP 5.0.23 is susceptible to remote code execution. An attacker
  can execute malware, obtain sensitive information, modify data, and/or gain full
  control over a compromised system without entering necessary credentials.
reference: 'Generated by converting Nuclei Template. Template ID: thinkphp-5023-rce
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dr_set; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: POST
  selection-paths-1:
    cs-uri-stem:
      - /index.php
  selection-query-1:
    cs-uri-query:
      - s=captcha
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
