title: Netsweeper 4.0.9 - Open Redirect
id: ec7aeafd-51d0-41f7-99c2-4d41bb72006a
status: experimental
logsource:
  product: webserver
description: Netsweeper 4.0.9 contains an open redirect vulnerability. An attacker
  can redirect a user to a malicious site and possibly obtain sensitive information,
  modify data, and/or execute unauthorized operations.
reference: 'Generated by converting Nuclei Template. Template ID: netsweeper-open-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: daffainfo; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /webadmin/authportal/bounce.php
  selection-query-1:
    cs-uri-query:
      - url=https://interact.sh/
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
