title: WordPress Plugin Qards
id: 2f31ba51-1958-4ee1-93e8-3e1303eb4b05
status: experimental
logsource:
  product: webserver
description: Searches for sensitive directories present in the qards plugin.
reference: 'Generated by converting Nuclei Template. Template ID: wp-qards-listing
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pussycat0x; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/qards/
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
