title: Huijietong - Local File Inclusion
id: 60a3dbca-7a4d-41fd-82b9-ccb3f1bc2753
status: experimental
logsource:
  product: webserver
description: Huijietong is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: huijietong-cloud-fileread
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha,ritikchaddha; Converted to Sigma by:
  @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: POST
  selection-paths-1:
    cs-uri-stem:
      - /fileDownload
  selection-query-1:
    cs-uri-query:
      - action=downloadBackupFile
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
