title: Joomla MarvikShop ShoppingCart 3.4 - Cross-Site Scripting
id: c85d1b29-3c61-4106-acb4-0324e81d9c99
status: experimental
logsource:
  product: webserver
description: 'Joomla MarvikShop ShoppingCart 3.4 is vulnerable to reflected xss where
  attacker can send to victim a link containing a malicious URL in an email or instant
  message can perform a wide variety of actions, such as stealing the victim''s session
  token or login credentials.

  '
reference: 'Generated by converting Nuclei Template. Template ID: joomla-marvikshop-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - option=com_oscommerce&osMod=mshop_pl_src&manufacturers_id=7&sort=products_sort_order&page=index.php&format=xml&task=showproducts&view=med&sort=latest&sortdir=descgt5po%3Cimg%20src=a%20onerror=alert(document.domain)%3Evh217
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
