title: Dede CMS - SQL Injection
id: 9bfc217d-58c0-4693-a039-8baf4fa9faf6
status: experimental
logsource:
  product: webserver
description: Dede CMS contains a SQL injection vulnerability which allows remote unauthenticated
  users to inject arbitrary SQL statements via the ajax_membergroup.php endpoint and
  the membergroup parameter.
reference: 'Generated by converting Nuclei Template. Template ID: dedecms-membergroup-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /member/ajax_membergroup.php
  selection-query-1:
    cs-uri-query:
      - action=post&membergroup=@`'`/*!50000Union+*/+/*!50000select+*/+md5({{num}})+--+@`'`
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
