title: Ruby on Rails - CRLF Injection and Cross-Site Scripting
id: e70eb828-760a-4938-81ea-9beaf70bcb6c
status: experimental
logsource:
  product: webserver
description: Ruby on Rails 6.0.0-6.0.3.1 contains a CRLF issue which allows JavaScript
  to be injected into the response, resulting in cross-site scripting.
reference: 'Generated by converting Nuclei Template. Template ID: rails6-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ooooooo_q,rootxharsh,iamnoooob; Converted to Sigma
  by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: POST
  selection-paths-1:
    cs-uri-stem:
      - /rails/actions
  selection-query-1:
    cs-uri-query:
      - error=ActiveRecord::PendingMigrationError&action=Run%20pending%20migrations&location=%0djavascript:alert(1)//%0aaaaaa
  selection-status-code-1:
    sc-status: 302
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
