title: Yonyou U8 - SQL Injection
id: 173c437f-f542-49f4-97cb-2f538e1d4694
status: experimental
logsource:
  product: webserver
description: Yonyou U8 contains a SQL injection vulnerability. An attacker can possibly
  obtain sensitive information from a database, modify data, and execute unauthorized
  administrative operations in the context of the affected site.
reference: 'Generated by converting Nuclei Template. Template ID: yonyou-u8-oa-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /yyoa/common/js/menu/test.jsp
  selection-query-1:
    cs-uri-query:
      - doType=101&S1=(SELECT%20md5({{num}}))
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
