title: openSIS 5.1 - Local File Inclusion
id: ef528027-16b7-413d-9f59-955312774068
status: experimental
logsource:
  product: webserver
description: openSIS 5.1 is vulnerable to local file inclusion and allows attackers
  to obtain potentially sensitive information by executing arbitrary local scripts
  in the context of the web server process. This may allow the attacker to compromise
  the application and computer; other attacks are also possible.
reference: 'Generated by converting Nuclei Template. Template ID: opensis-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /opensis/ajax.php
      - /ajax.php
  selection-query-1:
    cs-uri-query:
      - modname=misc/../../../../../../../../../../../../../etc/passwd&bypass=Transcripts.php
      - modname=misc/../../../../../../../../../../../../../etc/passwd&bypass=Transcripts.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
