title: Global Domains International - Cross-Site Scripting
id: 1148154c-0565-4fc7-8053-82d8d544cb01
status: experimental
logsource:
  product: webserver
description: 'Sites hosted by Global Domains International, Inc. have cross-site scripting
  and directory traversal vulnerabilities.

  '
reference: 'Generated by converting Nuclei Template. Template ID: global-domains-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.dhtml
  selection-query-1:
    cs-uri-query:
      - sponsor=%3C%2Fscript%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
