title: Parallels H-Sphere - Cross-Site Scripting
id: 86d5f7d0-38f6-4996-a9f8-26b031d87fdb
status: experimental
logsource:
  product: webserver
description: 'Parallels H-Sphere contains multiple cross-site scripting vulnerabilities
  because it fails to sufficiently sanitize user-supplied data. An attacker may leverage
  these issues to execute arbitrary script code in the browser of an unsuspecting
  user in the context of the affected site. This may allow the attacker to steal cookie-based
  authentication credentials and to launch other attacks.

  '
reference: 'Generated by converting Nuclei Template. Template ID: parallels-hsphere-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /webshell4/login.php
      - /webshell4/login.php
  selection-query-1:
    cs-uri-query:
      - err=%22%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
      - login=%22%3E%3Cscript%3Ealert%28document.domain%29%3C%2Fscript%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
