title: PHPOK - SQL Injection
id: c0c88334-d164-430e-9adc-3e700c469f57
status: experimental
logsource:
  product: webserver
description: PHPOK contains a SQL injection vulnerability via a GET request. An attacker
  can possibly obtain sensitive information from a database, modify data, and execute
  unauthorized administrative operations in the context of the affected site.
reference: 'Generated by converting Nuclei Template. Template ID: phpok-sqli Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /api.php
  selection-query-1:
    cs-uri-query:
      - c=project&f=index&token=1234&id=news&sort=1 and extractvalue(1,concat(0x7e,md5({{num}})))
        --+
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
