title: WordPress All-in-One Security <=4.4.1 - Open Redirect
id: 29f497c9-d37d-4256-b7d6-756bfff42295
status: experimental
logsource:
  product: webserver
description: 'WordPress All-in-One Security plugin through 4.4.1 contains an open
  redirect vulnerability which can expose the actual URL of the hidden login page
  feature. An attacker can redirect a user to a malicious site and possibly obtain
  sensitive information, modify data, and/or execute unauthorized operations.

  '
reference: 'Generated by converting Nuclei Template. Template ID: wp-security-open-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: akincibor; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - aiowpsec_do_log_out=1&after_logout=https://interact.sh
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
