title: ASP-Nuke - Open Redirect
id: 5fa2a470-2723-4e05-a52a-07b83806dc49
status: experimental
logsource:
  product: webserver
description: ASP-Nuke contains an open redirect vulnerability. An attacker can redirect
  a user to a malicious site and possibly obtain sensitive information, modify data,
  and/or execute unauthorized operations.
reference: 'Generated by converting Nuclei Template. Template ID: aspnuke-openredirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pdteam; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /gotoURL.asp
  selection-query-1:
    cs-uri-query:
      - url=interact.sh&id=43569
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
