title: TamronOS IPTV/VOD - Remote Command Execution
id: a33e186d-045f-435a-9c22-1558d8f74d40
status: experimental
logsource:
  product: webserver
description: 'TamronOS IPTV/VOD contains a remote command execution in the ''host''
  parameter of the /api/ping endpoint.

  '
reference: 'Generated by converting Nuclei Template. Template ID: tamronos-rce Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /api/ping
  selection-query-1:
    cs-uri-query:
      - count=5&host=;cat%20/etc/passwd;&port=80&source=1.1.1.1&type=icmp
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
