title: WordPress Wordfence 7.4.6 - Cross0Site Scripting
id: 061a6fce-bc9b-4ede-8d5e-6097996f65c4
status: experimental
logsource:
  product: webserver
description: WordPress Wordfence 7.4.6 is vulnerable to cross-site scripting.
reference: 'Generated by converting Nuclei Template. Template ID: wordpress-wordfence-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: madrobot; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/wordfence/lib/diffResult.php
  selection-query-1:
    cs-uri-query:
      - file=%27%3E%22%3Csvg%2Fonload=confirm%28%27test%27%29%3E
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
