title: Sickbeard - Cross-Site Scripting
id: df039d69-46ac-4870-b29d-fcb056472323
status: experimental
logsource:
  product: webserver
description: Sickbeard contains a cross-site scripting vulnerability. An attacker
  can execute arbitrary script in the browser of an unsuspecting user in the context
  of the affected site. This can allow the attacker to steal cookie-based authentication
  credentials and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: sick-beard-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /config/postProcessing/testNaming
  selection-query-1:
    cs-uri-query:
      - pattern=%3Csvg/onload=alert(document.domain)%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
