title: ServiceNow Helpdesk Credential Exposure
id: 5898642f-e8da-48ab-a670-b8a7fcd41320
status: experimental
logsource:
  product: webserver
description: Detection of exposed credentials in help the help desk JS file.
reference: 'Generated by converting Nuclei Template. Template ID: servicenow-helpdesk-credential
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ok_bye_now; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - '{{RootURL}}/HelpTheHelpDesk.jsdbx'
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
