title: Ruijie Networks Switch eWeb S29_RGOS 11.4 - Local File Inclusion
id: 54c79756-c235-4b97-93c2-2e2561bc9a9d
status: experimental
logsource:
  product: webserver
description: Ruijie Networks Switch eWeb S29_RGOS 11.4 is vulnerable to local file
  inclusion and allows remote unauthenticated attackers to access locally stored files
  and retrieve their content via the 'download.do' endpoint.
reference: 'Generated by converting Nuclei Template. Template ID: ruijie-networks-lfi
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pikpikcu; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /download.do
  selection-query-1:
    cs-uri-query:
      - file=../../../../config.text
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
