title: WordPress Newsletter Manager < 1.5 - Unauthenticated Open Redirect
id: 529b588e-b262-44c1-8f3d-74e7d6d098f9
status: experimental
logsource:
  product: webserver
description: WordPress Newsletter Manager < 1.5 is susceptible to an open redirect
  vulnerability. The plugin used base64 encoded user input in the appurl parameter
  without validation to redirect users using the header() PHP function, leading to
  an open redirect issue.
reference: 'Generated by converting Nuclei Template. Template ID: newsletter-open-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - wp_nlm=confirmation&appurl=aHR0cDovL2ludGVyYWN0LnNo
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
