title: Ecology OA CheckServer - SQL Injection
id: 94f74618-47f8-4727-bde6-202186919cf1
status: experimental
logsource:
  product: webserver
description: 'Ecology OA system improperly filters incoming data from users, resulting
  in a SQL injection vulnerability. Remote and unauthenticated attackers can use this
  vulnerability to conduct SQL injection attacks and steal sensitive database information.

  '
reference: 'Generated by converting Nuclei Template. Template ID: weaver-checkserver-sqli
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /mobile/plugin/CheckServer.jsp
  selection-query-1:
    cs-uri-query:
      - type=mobileSetting
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
