title: Web Page Test - Server Side Request Forgery (SSRF)
id: 4c9522ed-2f88-4be4-a7e9-955a788665c4
status: experimental
logsource:
  product: webserver
description: Web Page Test is vulnerable to SSRF.
reference: 'Generated by converting Nuclei Template. Template ID: webpagetest-ssrf
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pdteam; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /jpeginfo/jpeginfo.php
  selection-query-1:
    cs-uri-query:
      - url={{interactsh-url}}
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
