title: WordPress Themes Haberadam JSON API - IDOR and Path Disclosure
id: 0b85e655-7a66-4122-9d03-5e2685f81086
status: experimental
logsource:
  product: webserver
description: This template is designed to detect a misconfiguration vulnerability
  in WordPress themes that use the Haberadam JSON API. This vulnerability can lead
  to an Insecure Direct Object Reference (IDOR) and path disclosure, potentially exposing
  sensitive information.
reference: 'Generated by converting Nuclei Template. Template ID: wp-haberadam-idor
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: pussycat0x; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/themes/haberadam/api/mobile-info.php
      - /blog/wp-content/themes/haberadam/api/mobile-info.php
  selection-query-1:
    cs-uri-query:
      - id=
      - id=
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
