title: SAP Solution Manager - Open Redirect
id: 9e4c8f10-53e2-4aae-b42f-4dad94dcda04
status: experimental
logsource:
  product: webserver
description: SAP Solution Manager contains an open redirect vulnerability via the
  logoff endpoint. An attacker can redirect a user to a malicious site and possibly
  obtain sensitive information, modify data, and/or execute unauthorized operations.
reference: 'Generated by converting Nuclei Template. Template ID: sap-redirect Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: Gal Nagli; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /sap/public/bc/icf/logoff
  selection-query-1:
    cs-uri-query:
      - redirecturl=https://interact.sh
  selection-status-code-1:
    sc-status: 302
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
