title: NetMizer LogManagement System cmd.php  - Remote Code Execution
id: 8c2e48ce-7c06-4282-b8e0-6d9d47758b80
status: experimental
logsource:
  product: webserver
description: 'Remote Command Execution vulnerability in the NetMizer log management
  system cmd.php, and the attacker can execute the command by passing in the cmd parameter.

  '
reference: 'Generated by converting Nuclei Template. Template ID: netmizer-cmd-rce
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: DhiyaneshDk; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /data/manage/cmd.php
  selection-query-1:
    cs-uri-query:
      - cmd=id
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
