title: Linux Vmware Vcenter - Local File Inclusion
id: 1ca33e78-c360-48ae-9d4c-d8f0a3c71c8b
status: experimental
logsource:
  product: webserver
description: Linux appliance based Vmware Vcenter is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: vmware-vcenter-lfi-linux
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: PR3R00T; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /eam/vib
  selection-query-1:
    cs-uri-query:
      - id=/etc/passwd
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
