title: Simple CRM 3.0 SQL Injection and Authentication Bypass
id: 64afce24-8563-4b27-b248-08fa2d20f109
status: experimental
logsource:
  product: webserver
description: Simple CRM 3.0 is susceptible to SQL injection and authentication bypass
  vulnerabilities.
reference: 'Generated by converting Nuclei Template. Template ID: simple-crm-sql-injection
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: geeknik; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: POST
  selection-paths-1:
    cs-uri-stem:
      - /scrm/crm/admin
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
