title: MyuCMS - Local File Inclusion
id: 3e99dce6-1e70-4ffb-8d45-6b4e3ac82a02
status: experimental
logsource:
  product: webserver
description: MyuCMS is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: myucms-lfr Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: princechaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /index.php/bbs/index/download
  selection-query-1:
    cs-uri-query:
      - url=/etc/passwd&name=1.txt&local=1
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
