title: MicroStrategy tinyurl - Server-Side Request Forgery (Blind)
id: 010b4eb3-6f95-42d8-aaa4-24469c218230
status: experimental
logsource:
  product: webserver
description: Blind server-side (SSRF) request forgery vulnerability on MicroStrategy
  URL shortener.
reference: 'Generated by converting Nuclei Template. Template ID: microstrategy-ssrf
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: organiccrap; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /servlet/taskProc
      - /MicroStrategy/servlet/taskProc
  selection-query-1:
    cs-uri-query:
      - taskId=shortURL&taskEnv=xml&taskContentType=xml&srcURL=https://google.com
      - taskId=shortURL&taskEnv=xml&taskContentType=xml&srcURL=https://google.com
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
