title: WordPress Pie Register < 3.7.2.4 - Open Redirect
id: d55972fe-446f-44ef-9196-4b29e5d75630
status: experimental
logsource:
  product: webserver
description: WordPress Pie Register < 3.7.2.4 is susceptible to an open redirect vulnerability
  because the plugin passes unvalidated user input to the wp_redirect() function.
reference: 'Generated by converting Nuclei Template. Template ID: pieregister-open-redirect
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: 0x_Akoko; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /
  selection-query-1:
    cs-uri-query:
      - piereg_logout_url=true&redirect_to=https://interact.sh
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
