title: Carel pCOWeb HVAC BACnet Gateway 2.1.0 - Local File Inclusion
id: 111ef5f1-1800-4611-a981-96edebef2435
status: experimental
logsource:
  product: webserver
description: Carel pCOWeb HVAC BACnet Gateway 2.1.0 is vulnerable to local file inclusion
  because of input passed through the 'file' GET parameter through the 'logdownload.cgi'
  Bash script is not properly verified before being used to download log files. This
  can be exploited to disclose the contents of arbitrary and sensitive files via directory
  traversal attacks.
reference: 'Generated by converting Nuclei Template. Template ID: carel-bacnet-gateway-traversal
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: gy741; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /usr-cgi/logdownload.cgi
  selection-query-1:
    cs-uri-query:
      - file=../../../../../../../../etc/passwd
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
