title: Atlassian Confluence < 5.8.6 Server-Side Request Forgery
id: 89958c74-3fc9-4674-8fce-bbe0b522119b
status: experimental
logsource:
  product: webserver
description: Atlassian Confluence < 5.8.6 is affected by a blind server-side request
  forgery vulnerability in the widgetconnector plugin.
reference: 'Generated by converting Nuclei Template. Template ID: confluence-ssrf-sharelinks
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: TechbrunchFR; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /rest/sharelinks/1.0/link
  selection-query-1:
    cs-uri-query:
      - url=https://{{interactsh-url}}/
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
