title: Kingsoft 8 - Local File Inclusion
id: 1d0677ef-cbe0-4d73-bbad-ab1d832d41b6
status: experimental
logsource:
  product: webserver
description: Kingsoft 8 is vulnerable to local file inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: kingsoft-v8-file-read
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /htmltopdf/downfile.php
  selection-query-1:
    cs-uri-query:
      - filename=/windows/win.ini
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
