title: AVTECH DVR - Login Verification Code Bypass
id: 9a434fc1-53b1-4093-a02a-900fb1fdaf64
status: experimental
logsource:
  product: webserver
description: 'AVTECH DVR products are  vulnerable to verification code bypass just
  by entering the "login=quick" parameter to bypass verification code.

  '
reference: 'Generated by converting Nuclei Template. Template ID: avtech-verification-bypass
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: ritikchaddha; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /cgi-bin/nobody/VerifyCode.cgi
  selection-query-1:
    cs-uri-query:
      - account={{base64(username + ':' + password)}}&login=quick
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
