title: WordPress Adivaha Travel Plugin 2.3 - Cross-Site Scripting
id: 58ba0f29-bc08-4ac5-a65e-455cfb6364ff
status: experimental
logsource:
  product: webserver
description: 'The attacker can send to victim a link containing a malicious URL in
  an email or instant message can perform a wide variety of actions, such as stealing
  the victim''s session token or login credentials

  '
reference: 'Generated by converting Nuclei Template. Template ID: wp-adivaha-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /mobile-app/v3/
  selection-query-1:
    cs-uri-query:
      - pid=77A89299&isMobile=%20clq95%22%3E%3Cscript%3Ealert(document.domain)%3C/script%3Elb1ra
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
