title: WordPress Cherry < 1.2.7 - Unauthenticated Arbitrary File Upload and Download
id: c73dd42b-9064-4d4a-a55c-730cab7d4405
status: experimental
logsource:
  product: webserver
description: WordPress plugin Cherry < 1.2.7 has a vulnerability which enables an
  attacker to upload files directly to the server. This could result in attacker uploading
  backdoor shell scripts or downloading the wp-config.php file.
reference: 'Generated by converting Nuclei Template. Template ID: cherry-lfi Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: dhiyaneshDK; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /wp-content/plugins/cherry-plugin/admin/import-export/download-content.php
  selection-query-1:
    cs-uri-query:
      - file=../../../../../wp-config.php
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
