title: AIC Intelligent Campus System - Password Exposure
id: fa8833bf-73e8-4a7a-a9d0-ac025e1eec07
status: experimental
logsource:
  product: webserver
description: 'Due to the design logic defects, the super password is leaked, which
  can kill more than 40 campus systems.<br>

  '
reference: 'Generated by converting Nuclei Template. Template ID: aic-intelligent-password-exposure
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: SleepingBag945; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /datacenter/dataOrigin.ashx
  selection-query-1:
    cs-uri-query:
      - c=login
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
