title: NUUO NVRmini 2 3.0.8 - Remote Code Execution
id: 888d5ef7-7bd0-4ba6-b062-da36bf5f3af8
status: experimental
logsource:
  product: webserver
description: 'NUUO NVRmini 2 3.0.8 is susceptible to remote code execution.

  '
reference: 'Generated by converting Nuclei Template. Template ID: nuuo-nvrmini2-rce
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: berkdusunur; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /upgrade_handle.php
  selection-query-1:
    cs-uri-query:
      - cmd=writeuploaddir&uploaddir=%27;whoami;%27
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
