title: Office Suite Premium < 10.9.1.42602 - Cross-Site Scripting
id: 6e6633dd-46ad-4b2e-9543-cdd9ca1b7258
status: experimental
logsource:
  product: webserver
description: 'Office Suite is suffering from an XSS vulnerability in the following
  parameter /api?path=files&id. Attackers often initiate an XSS attack by sending
  a malicious link to a user and enticing the user to click it.

  '
reference: 'Generated by converting Nuclei Template. Template ID: office-suite-xss
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3Y3r53; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /api
  selection-query-1:
    cs-uri-query:
      - path=files&id=dfsse%3Cimg%20src%3da%20onerror%3dalert(document.domain)%3Ez1668cyj2pi&revision=%22%22&type=%22thumb%22&command=url&expires=1687785968527
  filter-status-code-1:
    sc-status: 404
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and not
    filter-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
