title: Symantec Messaging Gateway <=10.6.1 - Local File Inclusion
id: 18c06955-b495-4736-918a-c79071cbb391
status: experimental
logsource:
  product: webserver
description: Symantec Messaging Gateway 10.6.1 and prior are vulnerable to local file
  inclusion.
reference: 'Generated by converting Nuclei Template. Template ID: symantec-messaging-gateway
  Refer the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: Random_Robbie; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /brightmail/servlet/com.ve.kavachart.servlet.ChartStream
  selection-query-1:
    cs-uri-query:
      - sn=../../WEB-INF/
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
