title: Tiki Wiki CMS Groupware v25.0 - Cross Site Scripting
id: d3a6704d-38bd-426f-ae2d-155edecf2204
status: experimental
logsource:
  product: webserver
description: 'Tiki Wiki CMS Groupware version 25.0 suffers from a cross site scripting
  vulnerability.

  '
reference: 'Generated by converting Nuclei Template. Template ID: tikiwiki-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: arafatansari; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /tiki/tiki-ajax_services.php
      - /tiki-ajax_services.php
  selection-query-1:
    cs-uri-query:
      - controller=comment&action=list&type=wiki+page&objectId=<script>alert(document.domain)</script>
      - controller=comment&action=list&type=wiki+page&objectId=<script>alert(document.domain)</script>
  selection-status-code-1:
    sc-status: 403
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
