title: Blackboard - Cross-Site Scripting
id: 13953db9-762b-4f65-8651-d359ece66e5a
status: experimental
logsource:
  product: webserver
description: Blackboard contains a cross-site scripting vulnerability. An attacker
  can execute arbitrary script in the browser of an unsuspecting user in the context
  of the affected site. This can allow the attacker to steal cookie-based authentication
  credentials and launch other attacks.
reference: 'Generated by converting Nuclei Template. Template ID: parentlink-xss Refer
  the templates here: https://github.com/projectdiscovery/nuclei-templates'
author: 'Exploit/Attack Authors: r3naissance; Converted to Sigma by: @pbssubhash'
date: 2024/06/23
detection:
  selection-method-1:
    cs-method: GET
  selection-paths-1:
    cs-uri-stem:
      - /main/blank
      - /main/blank
  selection-query-1:
    cs-uri-query:
      - message_success=%3Cimg%20src%3Dc%20onerror%3Dalert(8675309)%3E
      - message_error=%3Cimg%20src%3Dc%20onerror%3Dalert(8675309)%3E
  selection-status-code-1:
    sc-status: 200
  condition: selection-method-1 and selection-paths-1 and selection-query-1 and selection-status-code-1
level: low
falsepositives: Nuclei scanning, Legitimate penetration testing
